{"selftext":{"0":"It has historically been the policy of the mod team here at UnpopularOpinion that “everyone has a right to be wrong.” As long as it didn’t hurt anyone (e.g. hate and harassment), we have always believed that letting people argue it out was the best practice.\n\nThe global COVID-19 pandemic has put that policy to the test. With health experts worldwide citing the prevalence of misinformation on social media as a major cause for the continuation of this health crisis, we no longer feel confident that our hands-off policy is not hurting people.\n\n**Rather than appoint ourselves the arbiters of what counts as misinformation, going forward, UnpopularOpinion will be removing ALL submissions related to the COVID-19 pandemic and its countermeasures. Attempting to circumvent this prohibition will result in a temp-ban (escalated to permanent for repeat offenses.)**\n\nIf you are seeking information regarding this ongoing crisis, [this link](https:\/\/www.reddit.com\/r\/Coronavirus\/comments\/pbo8yv\/misinformation_is_bad_good_information_is_good\/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf) should provide an good starting point.\n\nStay safe and stay healthy,\nYour UO Mod Team","1":"Greetings, you opinionated, unpopular lot! This is your one-stop shop for all of the ridiculously reposted topics on this sub. This hub and the linked threads below will be replaced every 7 days to keep things fresh.\r\n\r\n0. [Meta](https:\/\/www.reddit.com\/r\/unpopularopinion\/comments\/pt0i1h\/meta_mega_thread\/)\r\n1. [LGBTQ+](https:\/\/www.reddit.com\/r\/unpopularopinion\/comments\/pt0i1t\/lgbtq_mega_thread\/)\r\n2. [Men's\/Women's Issues](https:\/\/www.reddit.com\/r\/unpopularopinion\/comments\/pt0i1j\/menswomens_issues_mega_thread\/)\r\n3. [Race related issues](https:\/\/www.reddit.com\/r\/unpopularopinion\/comments\/pt0i1k\/race_related_issues_mega_thread\/)\r\n4. [Social Media](https:\/\/www.reddit.com\/r\/unpopularopinion\/comments\/pt0i1p\/social_media_mega_thread\/)\r\n5. [Veganism\/Animal rights](https:\/\/www.reddit.com\/r\/unpopularopinion\/comments\/pt0i1q\/veganismanimal_rights_mega_thread\/)\r\n6. [Religion](https:\/\/www.reddit.com\/r\/unpopularopinion\/comments\/pt0i1r\/religion_mega_thread\/)\r\n7. [Politics](https:\/\/www.reddit.com\/r\/unpopularopinion\/comments\/pt0i1l\/politics_mega_thread\/)\r\n8. [Abortion](https:\/\/www.reddit.com\/r\/unpopularopinion\/comments\/pt0i1m\/abortion_mega_thread\/)\r\n9. [Gun rights\/Mass shootings](https:\/\/www.reddit.com\/r\/unpopularopinion\/comments\/pt0i1o\/gun_rightsmass_shootings_mega_thread\/)\r\n10. [Coronavirus](https:\/\/www.reddit.com\/r\/unpopularopinion\/comments\/pt0i1n\/coronavirus_mega_thread\/)\r\n11. [Parenting\/Family issues](https:\/\/www.reddit.com\/r\/unpopularopinion\/comments\/pt0i1s\/parentingfamily_issues_mega_thread\/)","2":"Edit: disclaimer: in this post I use this really rare and undiscovered thing called dramatic effect, in which I over exaggerate certain words and moods to create a more dramatic affect. So, to clarify, no this does not actually make my blood broil. It mildly annoys me for a brief period of time then I forget about it and move on from it. \n\nEvery time I hear someone say they “can’t cook” it makes my blood broil. It’s not hard, just follow the fucking recipe. You didn’t fuck up your dessert because you can’t cook, you fucked it up because you decided to skip salt because “desserts should be sweet and not salty.” You fucked up your cookies because instead of leaving them in the oven for 30 minutes at 250, you decided to put them in there for 500 for 15 minutes to speed up the process. \n\nIf you would just follow the recipe then the food will turn out fine. Will it be the best? No. Will it taste like your grandmas cooking? Of course not. But it will still be good. I understand that some people are naturally gifted and others aren’t, but if you’re not naturally gifted then stop trying to add ten goddamn seasonings because you think they sound cool and just add salt and pepper. \n\nNobody is “bad” at cooking, they just refuse to follow the directions. 9\/10 times the reason these people mess up their food is because they decided to do things their way and completely ruined everything. So no, you’re not bad at cooking, you just refuse to follow the detailed instructions left by whoever wrote the recipe.\n\nEdit: When I say this, I’m talking about people who can cook but just don’t want to\/ refuse to. If you’d rather eat out every night that’s fine, go ahead, but don’t tell me the reason you eat McDonalds every night instead of cooking something at home is because “you can’t cook.”\n\nEdit 2: A lot of people are saying it depends on the recipe or they are too lazy so I’m going to address both right here. \n\n1. Of course the recipe has an effect on the dish. However if you know you aren’t the best chef then don’t go and try to make a recipe that has 27 steps and takes 3 days to prepare. That’s just common sense. I thought that staying in your skill range was implied, but since many people missed the point I’ll state it here. \n\n2. If you’re too lazy to cook that doesn’t mean you can’t cook. I don’t like cooking every night so my brother does the cooking most of the time. Does that mean that I can’t cook? No, because whenever I step into the kitchen with the intent to make something 9\/10 times it turns out pretty good. Being too lazy to do something and not being able to do something are too different things entirely.","3":"As a former zookeeper, I have the opposite opinion: children under 6 should not be allowed in zoos for the sake of the animals.\n\nModern zoos (as opposed to the popular opinion) are meant for and aimed for conservation, research and education, and operate an the basis of \"animal welfare before guests' \".\n\nYoung kids don't really understand what they are seeing and the importance of it, and they constantly bang on glasses, disturb and feed the animals, and cause a myriad of problems. \n\nIf you go to the zoo to \"see the funny monkey\", you should watch youtube videos, not go to the zoo. The animal's enclosure is its home, and you wouldn't want people banging at your windows because you're \"boring\" or \"don't move enough\".","4":"I think that the vast majority of all poetry,\n\nis garbage. \n\nIt’s just a bunch of words put,\n\ntogether in a way that want to make,\n\nthe writer look intellectual and,\n\nthey always look for the weirdest,\n\nwords to make it seem even more intellectual. \n\nThere is good poetry but,\n\n99% is baloney.","5":"I really think that if you pay for food you should be allowed to do whatever you want to it, to make it more appealing to your taste buds, so whatever you add to it, the reason is never to disrespect the country\/culture it came from, it's just because you enjoy how it tastes like that way. And yes, I add ketchup to my pizza.","6":"Cheap products are a benefit of slavery. If you don't want to benefit from slavery, then don't buy a phone, or clothes, or consume any products from Nestle, or buy anything with batteries.\n\nSlavery still plays a huge role in the American economy. The only difference is that we do not own the slaves, we just buy from the people that do.","7":"If a company expects a 2 week notice, policy or not, they should also give 2 weeks notice for layoffs\/firings. I really don't like these \"at will\" employment policies; in certain states they can fire you for any non discriminatory reasons.  They can uproot your entire life at any minute, for no reason at all. Note: I have not been fired but watched others fired. \n\nNot talking about needing to fire people for threats, security issues, or stealing. They should be walked out immediately. \n\nIf not give 2 weeks notice for firing, give 2 weeks pay. \n\nWith the job market being less abusive to employees due to recent employee changes, I think companies will start to change to get workers for spots they can't fill. \n\nThoughts?","8":"Many schools have these strict rules where students hair has to be longer\/shorter than a certain lenght which is completely bullshit.  They should be allowed have their hair as long\/short as they want as long as it's somewhat tidy. If girls can have long hair, why can't boys. If boys can have shortish hair, why can't girls? Hair isn't going to affect their learning and most companies don't give a single fuck about how long\/short a person's hair is so there's no reason to have this bullshit rule\n\nThe people who run these schools are just power abusing wankers that shouldn't be allowed run a school.","9":"What on this hellscape called Earth, went through your mind and said,” Susie is failing her class, I’m going to shoot her phone as punishment.” Like what purpose does it serve? What was the purpose of you breaking the $500 console because chores are not being done?                                                         \nPersonally, I think it’s a step away from actually putting your hands on your child To me that means my broken laptop could have been my arm. The phone that was shot, could have been me. All they’re doing is creating a last impression on their child.                                 \n\n“ But they paid for it…” okay? They’ll continue to pay for. After their kid moves out, across the country and lose their number. You’re not going to destroy something that brings them joy and not think that they’ll be fine with it. You’re teaching you child to fear you, not respect.                                                                      \n\nEdit- Probably should have prefaced this by saying I’m not a parent. And there’s a very defensive person in the comments saying I’m shitting on parents for calling out psychological abuse that comes with destroying( or in this person’s case selling) their child’s things as a punishment.","10":"I believe Moana was a better film overall than Frozen. Moana was released 3 years after Frozen, but never received the recognition it deserved. It has a better storyline, character development, and music.","11":"I'm sorry, I have to drop everything to respond to you about coordinating shoe colors, even in the middle of my work day or personal issues? I have to buy a dress that I don't currently have money for RIGHT NOW because you're scared it won't get delivered before 4 months from now? (Shocker - it was delivered in a week btw) and for what? The 'honor' to stand next to you on your big day, with 5 other women, rather than be in the crowd supporting you from there? For a gift box that doesn't even cover the price of the ugly dress that I'll never wear again?\n\nAnd don't brides have more important things to worry about than making sure 6 other women are dressed exactly the same??\n\nWhy is this a tradition??","12":"As someone who's been a line cook in the past making $10\/hour working in a kitchen hotter than the devil's jockstrap after a relay race with orders coming in out the wazoo AND the pressures of not only preparing orders correctly but quickly, I've never seen a penny beyond my paycheck, whereas servers have made so much more than me taking orders and bringing out the food *I* cooked.\n\nEssentially, cooks should be getting the tips and bringing home the larger pay and servers should instead be earning a normal rate. \n\nDisclaimer: I'm not saying servers aren't working hard, I'm just saying cooks are the ones actually creating the product customers come for and should be compensated significantly as such.","13":"I get that people want their houses to look presentable and their instagram feeds to look good, but come on. Let them wear some brightly coloured character clothing or play with toys regardless of their colour etc… It really infuriates me. Nobody is going to unfollow you because you have a red car for your child and the rest of your house is grey. Nobody is going to unfollow you because your kid is wearing a Toy Story t-shirt instead of a beige oversized shirt.","14":"This comes from someone who is an avid boob lover. They dont look terrible but to me they're just impractical. I hate having that stainless steel in my mouth, both taste and texture wise. I always feel like a piece is going to come off and I'm going to choke on it or swallow it. They're just not sexy to me.","15":"Edit: I’m not saying this is a rude thing to do. I’m just saying they could if they wanted to.\n\nEdit 2: a lot of you guys are ignoring that 24hrs part. Please read carefully. No one is asking you to respond as soon as the text gets delivered lol","16":"Is it just to stroke their ego even more? It makes me gag when people introduce themselves or others as “Dr. And Mrs. or Mr. and Dr. So and so”. We get it you went to medical school, you’re not a doctor in this situation.","17":"I know that abstract art is, well, abstract, but i really don’t see how people can like it or call it a “masterpiece”. It is literally splashes of colors or blocks and people consider it amazing. I look at it and see nothing but a painting that looks like a 5 year old made it. To me, some of it just seems like it is something that took no effort to create, far from a masterpiece.","18":"It won't happen, because there's still the strange idea that horror writing isn't \"real\" literature or high culture. But King is one of the most prolific and popular writers of the era. He's responsible for so many modern classics, and is the writer behind the best-rated film of all time (Shawshank Redemption). I truly think that anyone who can't appreciate something he has written, has never picked up one of his books. Does the Nobel committee have the guts to acknowledge the impact King has had on the literary world?","19":"Technology has fast overtaken society on this one. Cameras used to he a rare novelty in our lives, and it was treated as fun when one was pointed at you. \n\nNow they're so ubiquitous that it's exhausting and inescapable. Every other house has a Ring doorbell and people just assume they can take your photo\/video you whenever it occurs to them. \n\nWhilst you obviously have the 'right' to film in public, that doesn't mean that it *is right.* you have the 'right' to fart in a lift or other enclosed space, but we recognise that it's not cool and so try not to.","20":"The media controls everyone like puppets and we don’t even realise it. I’m not saying media is a bad thing, but many mainstream news outlets spew out false information on a daily basis and the majority of the population believe it as fact and don’t bother to do their own research. \n\nIf nobody watched the news for a couple weeks I guarantee the general mood would become happier and a lot of people wouldn’t be living in constant fear.\n\nAll I’m trying to say is don’t believe everything you see online and do your own research to form own opinion.","21":"Many academically gifted students are only high-achieving because their parents constantly pressure them and bombard them with an insane amount of monitoring, rules, and expectations. These kids are coddled and sheltered from the real world, they think that as long as they do a good job and are perceived as \"smart\" or \"talented\", they will always be met with rewards and positive reinforcement.\n\nOnce they grow up and experience the real world for the first time, they become highly disappointed and end up turning into the \"mediocre\" individuals that their parents always tried so hard to prevent them from becoming. I have seen so many of these people go to college and flunk their first semester because \"the professors doesn't want to teach it to me\" or \"no one here wants to help me out\". \n\nI was always above average in school, but never the kid that would constantly get awards or receive praise from teachers for being such an excellent student. After going to college, I learned so much and flourished as an individual. Yet so many of my peers that were \"big fish\" ended up dropping out of school or just never left their hometown. \n\nI feel like parents are doing such a disservice to their kids by coddling them so much. Once they enter the real world and do not have someone above them to constantly give them commands and direct them through every obstacle, they either lose interest or find it very difficult to make their own decisions.","22":"I am tired of \"natural\" and alternative medicine hacks that act like they are revolutionaries for suggesting a healthy diet. I am an RN and work with a shitload of doctors, and every single one of them agrees health is 90% diet and exercise. \n\nWhen did everyone get the idea that conventional medicine thinks you can eat nothing but bacon amd candy bars, but you will be fine if you just get some shot? This bullshit notion needs to die and launched into the sun.\n\nThis does not mean that a healthy diet and lifestyle is a substitute for medicine. That notion also needs to die a violent death.","23":"Disney’s interpretation of the story really doesn’t help either when you dig deeper.\n\nPeter is obsessed with staying young and living care free life and abducts other children under the guise of helping them when actually he is just filling up the ranks of his army. \n\nWhen the members of the lost boys get older he thins out his army. He’s a dick to Wendy, a dick to Tinkerbell, and has absolutely no problem killing adults (as clearly stated in the authors original book, every breath Peter takes kills an adult in the real world)\n\nAnd hook? He’s just a man getting revenge on a boy who intentionally cut off his hand and fed it to a crocodile. His list of crimes isn’t nearly as long as Peter’s. \n\nPeter Pan is a selfish immature brat with too much power.","24":"I think there is always this idea that if you don't 'confront' your issues head on, you're seen as 'weak' or 'spineless', when such issues should be taken as a case by case issue.\n\nPeople often conflate the 'confrontation' when it's not necessary that every case requires you to 'stand up for yourself'\n\nI say this because if subreddits like watchpeopledie had taught me anything, it's that human beings are unpredictable.  The amount of times I've came across clips where an argument where one side refuses to back off suddenly ends up with a fist fight or shooting and one side dies. \n\nDo I really want my brains splattered on the sidewalk outside my favourite restaurant just because the guy in front spilled my drink? And have my family crying? Nah it's not worth it.\n\nIs it really worth it to get yourself in a confrontation and then get yourself or loved ones killed? I don't think so. Sometimes, or hell, most times, it's better to just let it slide. Most of these public issues are with strangers, I'm probably never gonna see them again, and I rather live another day than trying to prove I'm not 'weak' \n\nI often see Asian men get labelled in such a way because of the non-confrontational nature. But I think we  just have more important shit to deal with.\n\nAnd really it's just a waste of time.","25":"At least until the shortage is addressed. The vast majority of players cannot get a Ps5 unless its from a reseller for double the price or the very lucky who happen to catch one before the scalper bots work their magic. All the ads do is pour salt in the wound to most.","26":"I Didn't think this was an unpopular opinion but apparently it is becoming so\n\nRecently I've started fairly often seeing people online trying to say vasectomies are reversable and pushing men to get them, I don't understand why this has become a thing recently, like some bizarre trend\n\nIt is so untrue. Yes vasectomies *can* be reversed, sometimes, but doing so is not easy or reliable. The success rate of reversals is apparently only 45-75% depending how long you wait. Even at the highest end, that's still reletivley low\n\nMen should not be getting the snip unless they are completely certain they will never want kids in the future, and they should consider the procedure perminant. Even with a 75% chance of reversal, they should still consider it perminant\n\nDon't get me wrong, I'm not anti-vasectomy. They can be a good thing if they're right for you, but it should t be taken lightly and certainly isn't a good alternative for contraception in general","27":"All of the fast food chains produce spicy chicken that is tailored for 8 year olds to eat. They all worry way too much about people being unable to eat the food because it is too spicy. I shouldn’t have to travel around with a bottle of last dab sauce (hot ones) because fucking Karen is going to complain that her child burned its mouth. It’s the parents fucking fault if their kids eat food that they cannot handle. The real assholes say something like, ghost pepper chicken nuggets, and then you try it and it isn’t spicy at all. So fucking annoying.","28":"No spoilers here for those of you who haven't watched any of these movies. I don't think Frozen is a bad movie, it is really good and I enjoy it. But Tangled interests me more in general, especially after watching the series.\n\nI mean the songs from Tangled aren't the best, Frozen has better songs but I See The Light makes up for all of that in my opinion.  The songs from the series are amazing though. \n\nWith Frozen 2, while it does have great songs like Into The Unknown and Show Yourself, the plot has always been pretty confusing to me and doesn't really make sense. While with Tangled, both the movie and the series, the plot is straight forward but interesting.\n\nAnimation wise, these movies are great but story wise I prefer Tangled. Let me know what you think in the comments.","29":"I prefer to unwrap the top of my Kit Kat bar and then take a bit out of both halves. I don’t like breaking them in half because usually, my fingers get chocolate on them, and then I have to wash it off. I like to take a bite out of both pieces so I can hold it with the wrapper partially on and keep my fingers clean.","30":"It feels like many people on social media who post a lot of inspirational quotes are some of the most toxic people if you interact with them in real life. Does anyone else feel like this?","31":"Smart people aren't. They are always going to try and 1 up you in an argument. They don't know how to have fun or take a joke, all they use is sarcasm and they think it's cool when it's not. Yes, you can have all these traits and also be Smart. But I'm talking about those people that are Just Super smart and only care about grades, working on their careers, or some stupid boring bullshit. Like Live a little, Geez.","32":"Everything from Smart TVs, to Amazon Alexa and Google Home, to Smart fridges, to modern connected vehicles and much, much more all have the ability to be spy on their owners, whether that be through cameras, microphones, or data gathering and harvesting. And the saddest thing is, people have become okay with it, to the point they'll mindlessly go out to keep up with the Jones' and buy the latest stuff without even thinking about the implications, or just brushing it off.\n\nEven worse, is their argument in not caring. Their seeming number one excuse is \"Well, if you've done nothing wrong, you've got nothing to hide, right?\" No, wrong. That is the worst reason to not care. It shouldn't matter if you've got nothing to hide. A person's own individual privacy should matter much more than that. Privacy is an extension of personal freedom, and you are essentially giving away both your freedom and privacy, for, what? Convenience? So something is a tiny bit easier or more futuristic? Those are stupid reasons. \n\nNot even half a century ago, the idea of constantly being tracked, monitored and spied on, whether by governments, corporations, or anyone was considered one of the scariest and creepiest things imaginable. Dystopian novels like Fahrenheit 451 and 1984 showed it as oppressive, major Hollywood films, even as near as the turn of the century with movies like Enemy of the State showed the dark side to them. And yet, nobody gives a damn about it nowdays, or not the majority, at least. They've stopped caring, basically rolled over and let themselves have their privacy stripped away, filled their homes with hundreds of cameras and microphones. And, even when it's been proven that companies like Amazon or governments are listening in or watching, still, they try to justify why it shouldn't be a problem. \n\nHonestly, they're beyond stupid for all those reasons. I don't own, and never will own any smart devices or appliances, or voice assistants. I keep a flip phone instead of a smart phone. I will never purchase a connected vehicle. I repair and hold onto old appliances that do not have an internet connection. I will only rent older apartments or buy older houses or boats to live in or on that are not smart connected. Because I'm not stupid enough to willingly allow myself to be spied on that much. Yes, there are cameras everywhere now, so you can't fully stay away from being spied on unless you go off the grid in the woods, but I'm not willingly allowing any more than the bare minimum.\n\nAs for those who are dumb enough to buy all those things and not care about being spied on, all I have to say is, they'll have to learn the hard way about why buying them and not caring is a major mistake.","33":"We have our life too easy (Europe and North America) and it does not mean, we live good life. We (most of us) are soft and too afraid to tackle real threats by force. We like to theorise about our problems, not to solve them. We want to please everybody and we forgot, that progress sometimes requires hard work and sacrifice. I understand, that our parents and their grandparents worked hard, for us to live in prosperity, but now we have no direction and our society\/civilisation is moving too slow to healthy progress.","34":"Like who tf cares. Love has no value. Don't pretend like some stock market crashes when someone says it more often or \"too early\".\n\nI call love whatever romantic feeling I have. Fuck you. The only reason why I will date a person is when I love them aka have romantic interest. I will say it as an expression of my overwhelming emotions. Seeing posts\/comments that are like \"Oh, you can't say you 'fell on first sight' because that's not 'real love'\" -just stfu.\n\nYou don't get to say what's \"true love\". Love is subjective. For me it's the reason why I start dating someone in the first place, you can say it 3 years in or whatever. But don't go off on others. Who fucking started this crap in the first place? Puritans? \n\nIf you gatekeep legal love, you really have a sad, boring life.","35":"Some people eat at a restaurant daily. Not only is this expensive and helps exploitative industry stay afloat, but its mostly pointless and contributes massively to unhealthy levels of caloric consumption. Cooking most things is pretty easy and does not take much time at all. Most people's homecooking suffers because they don't use enough fat. Restaurants should be used when travelling and for special occasions.","36":"I've stumbled over rugged Chinese phones with 8500 mAh batteries, gaming phones like the Asus ROG Phone5, the privacy-oriented PinePhone, and lastly Samsung and Microsoft respectively with their folding devices. Smartphone manufacturers need to remove their heads from their asses and care about other features on a smartphone instead of throwing like 5 cameras on the back. I consider battery, software and screen quality to be much more important than cameras, which can be replaced by a dedicated point-and-shoot if you think about it.","37":"I know so many people who just brag about pulling an all nighter studying in college or doing work in their profession as if it is some kind of a badge of honor. \n\nFor me it just shows that you were not committed to start the task earlier and you are just growing your own stress culture rather than trying to be healthy.","38":"So I’m in currently in a fairly remote campground in a state forest, and I’m just not having the experience I was hoping for. At 7 AM, the RV next to me starts a generator, and that has been running for a couple of hours now. My partner and I were trying to sleep in a little, but it’s just not possible. Our tent allows us to hear sounds of nature, but that becomes impossible to hear over the sound of a loud generator. \n\nAnd last night, there was so much light pollution at our fire and in our tent from this other neighbor who has really bright LED porch lights on his camper. And I won’t even get started about the giant Bluetooth speaker and chainsaws I’ve been hearing from this trio of RVs parked on the other side of the campground. \n\nRVs and campers need to be banned from campgrounds or kept in their own separate area away from tent campers, which does happen sometimes, but more often than not that just means putting a few tent-only spots at the end of the row, still well within earshot of the glamper idiots. I’m sick of campgrounds catering to this crowd. Their RVs are massive and ugly, noisy, too bright, and often have the worst kind of people in them too. Sadly, these days I see more and more of them. \n\nI just want to escape away from everyday life to nature sometimes. This is becoming increasingly difficult.","39":"People that call themselves ugly are honestly sabotaging themselves. If you are not attractive that’s alright, most people are average anyway, but not being attractive doesn’t make you any worse. You have to stop looking so down on yourself. If you call yourself ugly you are meant to be seen as that and that sucks in a world where appearances are taken into account everywhere (even when it comes to being hired).\nIf you call yourself ugly to be complimented stop it, just say that you’d like some kind words, that’s way better.\nAnd if you truly feel ugly, instead of stating so you should try to work with what you have: groom yourself, eat healthy and be a kind person with some sense of humour.","40":"So, my best friend in the world, I’ve known him for many years. We still can’t remember each other’s birthdays. And you know one, it doesn’t matter. We never get each other birthday gifts, we never wish each other a happy birthday, but we’re still best friends. We don’t care about birthdays. They are pointless. I can’t remember people’s birthdays because I literally don’t care enough about birthdays to remember them. Stop getting offended by that.","41":"I hate it when I need something from a website and they mandate that I have like 4 different rules in order for my password to be approved. If I want my password to be 1234 or abcd on your site I should 100% be free to do so, even if it is a website that has my credit card info. I don't care if it's \"Weak\".\n\n This makes it so I either use my good password I remember on all sites, making it not as safe, or use a random password I almost never remember..  \n\nIf someone steals my information, that's 100% on me. Companies can demand a minimum password format if someone wants \"theft compensation insurance\" or something, but it shouldn't be mandatory just to register.","42":"Everyone has preferences, whether that be a height preference, weight preference, hair colour preference etc, so we should be allowed talk about them without being shat on. Just because someone has a preference, it doesn't mean they're shaming everyone else.","43":"Who wouldn’t just for one time on a really nice hot day be allowed to go out your house complete nude without the whole sexual shit that comes with it. Stark bollock naked. We’re born like it what is the crime just a little freedom to say yeah I’m naked so what.","44":"While I believe intrinsic empathy was one of the better things my parents gave me, both them and society at large makes no mention of the above difficulty.  \n  \nHaving empathy is great in theory, but in an imperfect and unjust world it's also a terrible weight. A weight constantly dragged behind you regardless of your wishes.  \n  \nAs an asid, I have nothing but the utmost respect of those who turn to helping careers, those who wake each day to keep trying. Not for their love, not for their morality or goodness, but for their sheer perseverance. It's taken many moons to realize, but imo that is true strength.","45":"I often see or hear people say „Oh s\/he‘s knows everything, s\/he‘s so intelligent!“ but that‘s BS. Intelligence is what you can do with the things you know. Knowing a lot makes you wise, not intelligent. \n\nSame goes for schoolgrades: they only portray your ability to remember stuff. No way are grades a way of judging a persons intellect.","46":"To be more precise, I'm talking about in bedrooms mainly. I also prefer it in a living room area too. The acoustics are so much better and to me it makes the space feel warmer and more comforting. The main advantage I see to hardwood is being able to clean in far easier.","47":"The idea of selling my house and moving to an apartment with much higher rent that has nothing to do besides wait for death just sounds awful to me. Have you seen how commonly old people get treated like crap in those senior care homes. And plus what is there to even do there besides wait for death? Like the idea of leaving everything only to be put in a crappy home with people who only care about money is not a great feeling. All you do in a nursing home is wait for death in a sad boring environment. To me just flat out dying early instead of spending several years in those homes is better.","48":"So like hear me out,imagine if a cinema showed once a week, one previously released movie, like the Lord of the rings,it would be an opportunity for people born after a movies release to experience it in a theater,imagine rewatching Empire Strikes Back in 3D in a dark theater,not sure if this is unpopular but just a thought","49":"Sometimes you see uplifting videos of dogs and cats that can't walk getting wheelchairs so they can use their front legs to walk. What kind of life is this for the animal? They should be euthanised .\n\nEDIT: Yes in some cases humans should be. Have you heard of voluntary assisted dying ? \n Also why the fuck is this being downvoted ? I gave a unpopular opinion. THW WHOLE POINT OF THIS SUB\n\nEDIT 2: My inbox is full of hate which I understand. \n\n\nI seem to of triggered alot of people and think it's because so many love dogs (myself included, I have 2) but consider what sort of life we can give them.","50":"“Oh look they did a thing and solved a big issue”\n\n“But didn’t they cause the issue in the first place? Ugh”\n\nNo, praise them.\n\nIt means they owned up to it. \n\nIf someone causes a problem and then later solved it. That doesn’t invalidate their achievement. Stop shitting on them.","51":"I recently heard from a friend that her cousin died, and to travel the body over here is thousands of dollars. In fact, the planning of the funeral itself is raking up to 10k+. I didn't say anything to her but what a waste of fucking money! The dudes dead! Cremate him where he died and send the ashes over here, much cheaper! No 5k coffin, no expensive tombstone or ceremony. Just seems like a total waste of money and effort. Oh but \"its what he would have wanted\", well he's dead, doesn't matter what he wants.\n\nThis goes for people dying and other people trying to live up to their wishes even though they don't want to. Just doing anything or paying for something you wouldn't normally do or pay for just because the person who wants you to is DEAD just seems stupid","52":"Two consenting adults should absolutely be able to legally handle a conflict with a pre established agreed upon “clean” fist fight. \n\nno one is trying to kill anyone, a mediator must be present, anyone rendered unconscious is harmed no more, no weapons etc.\n\nI honestly think society would be better off.","53":"Some people say I have an addiction. The people who say that usually just want more of my attention. I started when I was a child trying to find an escape from the religious torment my mother was inflicting on me. My \"friends\" were all older than me so I was always either left out, picked on, or bullied. There are only a few people I've met who were such a pleasure, that I didn't mind putting the controller down to spend time with them.\n Does it ever occur to anyone that video game addicts would interact with the real world more frequently if real world people would at least try to be more exciting to be around? Is this opinion really unpopular\n\nEdit: I'm not looking for sympathy or a psyche evaluation. The reason why I asked is because there is someone I met at work who made a comment about how frequently I play. I think this guy is annoying (which is why I rather play video games than go to the club with him). I just want to know your thought on video game frequency and addiction.","54":"If you say are disappointed by what you've done and the result you've gotten (e.g. in sport), some people will come and say \"you should be happy about your result, you cannot complain about it because you did much better than many other people\".\n\nBut I don't agree with that. Yes, you are allowed to not be happy about what you've done and seek improvement. You are allowed to not be satisfied.","55":"I was working at an internship this summer as I am in grad school. I was a lot older than the majority of the interns. (Approx 10yrs) and all of them used to say how much they hated small talk and how they like to have deep conversations. \n\nI get it, I like to have deep conversations too BUT you need to get to know someone first. I was asked a multitude of VERY personal questions right of the bat with some of these kids. \n\nI like talking about the weather, or your favorite sports team, or what you’re planning on making for dinner. It’s still says a lot about you. So let’s please relax from the 0-100 conversation topics. There is nothing wrong with small talk, it’s what happens in the beginning of any type of relationship.\n\nEDIT:\n\nI don’t think I made myself 100% clear. I definitely like to have deep\/personal conversations with people. BUT if I don’t know you very well, or at all on a personal level, this is where small talk comes in. Someone below made a phenomenal point that the younger generation is so used to sharing personal information with everyone online, that to them\nIt’s not a big deal. Personally I’m not very comfortable with it until I know you somewhat.","56":"Its simple. As an American, I don't want to send troops to countries no one's head of while taking orders from corrupt politicians and big oil. I want our troops to come home, [stop shooting](https:\/\/en.wikipedia.org\/wiki\/M%E1%BB%B9_Lai_massacre) and [drone striking civilians](https:\/\/en.wikipedia.org\/wiki\/Civilian_casualties_from_U.S._drone_strikes). And instead of spending trillions of dollars over 20 years [for a country to fall in weeks](https:\/\/en.wikipedia.org\/wiki\/2021_Taliban_offensive), we should invest in making our own country better.","57":"A few weeks ago I was mugged at knife point by a bunch of kids. These sociologists go on about crime being the result of poverty and inequality. But I will never forget the look of glee, excitement and pleasure of the kid who swung their knife at me. How exactly does growing up poor give you that outlook of taking pleasure at the fear and suffering of another human being. I'm not pointing at any fingers of a specific racial or ethnic group, anyone can be a criminal. But the look of fun and amusement while swinging a knife at another person is not just the result of poverty but intrinsic to the evil\/dark side of human nature that exists in all of us.","58":"\nThere is absolutely no mystery anymore. Everyone knows everything. It’s too much and Nobody needs to know all that.\nAlso because of cancel culture. Nowadays you can check out everything about a famous person.\n\nJust to give an example I was such a big fan of Bruce Lee when I was younger, but when I found out that he was cheating and his family image was fake….idk I was heartbroken 😂 …it seems so stupid. Lol\n\nI know they don’t own me anything, but neither do I.\n\nThe more they post the less I care. I do not want to buy their stuff. \nI mean i know it’s all about money but please make it less obvious. It’s too m","59":"I’ve been to a lot of weddings recently, and every single one has asked people not to take pictures during the ceremony… and people do it anyway. When they are called out, they say “I’m taking them for “bride” or “groom.” They spent hundreds (sometimes more) of dollars hiring a professional photographer with a fancy camera…. They don’t care about your photo that is half the back of someone’s head. However, you did just make the ceremony pictures look tacky because now you have a phone jutting up in the air. Congrats you’re an ass.","60":"Learning cursive helped me write far more naturally and fluidly. I am by no means a neat writer, and never was, but cursive lessons definitely helped me write smoother, faster, and neater.\n\nAnd also, being able to actually write in cursive has never ceased to be impressive.","61":"Let's be real here. It had more actual car culture and sick shots of actual racing than most of them. It doesn't take itself as seriously and the different cast opened up the world a bit. Teriyaki Boyz is still the boppiest of bops and Lil Bow Wow in his hulk car slays.\n\nI'll admit that I have a little bit of nostalgia for it, but I prefer it any day to the family-driven half-action series that needs guns and tanks and building jumps to constantly one up itself. Don't get me wrong, I'll watch the whole series happily but to me, Tokyo was the peak.","62":"Of course it's pretty haphazard but people act like it's certain it'll end in a lava pit and that certainly isnt true. It has never happened to me before. I'm not saying you should do it I'm just betting nothing will happen if you try it.","63":"Bonus points if you post them about your kids successes or something like that. Most people don’t care and if they do just tell them privately. Facebook is just turning into a brag contest and it’s incredibly annoying.","64":"I get sexual stuff, drugs, bloody stuff, but nudity doesn't make sense. It's a human body, kids have one themselves. \nWhy even brief nudity justifies a PG-13 rating in the US is beyond me.","65":"I don't like how sushi is cold so I microwave it until its piping hot before eating it. Personally, I think it tastes way better hot than cold. I don't even mind that they're raw, I sometimes put raw salmon sushi in the oven for a few minutes to get the salmon all nice and crispy before eating it.\n\nNo one else I know does this and they all think I'm a freak\n\nEdit : A word","66":"Me and my SO are polar opposites on this. She will know the cast, the plot, and all sorts of details before watching a movie. I will struggle to tell you the cast after watching it. \nWho is with me?","67":"If there's no love or feelings involved its pretty empty. \n\nI went to college I got plenty of \"practice\" and it's just a waste of time trying to find anything else but a relationship. \n\nFuck a hot girl after a bar night, ok its decent.","68":"There isn’t really any way to defend something like this for me because it’s so blatantly obvious but it’s just the perfect drink. Juices sometimes have additives and stuff so if you want something purely fruit, veggie, and whatever liquid base you desire smoothies are the best choice. \n\nYou can also hide anything in those things. I had my first banana in ten years yesterday because of a smoothie. I hate bananas but I didn’t taste that shit at all under the seasonings and walnut. \n\nTruly nothing compares to a fresh morning smoothie.","69":"I have never found one that is comfortable. They suck to sit down in and they suck to get out of. I’d rather just sit on the ground. Stop torturing your friends with these shitty chairs.","70":"It seems like it is somewhat of a hidden rule: if you know someone (a friend, a family member, a co-worker...) is cheating on their partner, you should just mind your own business and never say a thing.\n\nWell, I COMPLETELY disagree with this. I think people have the right to know the truth. Even if the cheater is your best friend, even if you think the person being cheated on won't believe you... at least THEY SHOULD KNOW. \n\nI just hate it when I find out that someone was being cheated and realize that everyone knew it and pretended not to. It's like we're letting the person make a fool out of themselves and live in a alternate reality that everyone else knows is fake. It's not fair.","71":"\"Seasonal depression\" doesn't even begin to cover it. Its not like that. The minute the cold comes I feel a dread. It's a heavy looming dread\n\nI think I must have suffered very cold hard winters in a past life because its like this every year. The minute the cold weather comes I feel an instant cabin fever\/sadness \n\nI mourn the loss of the life thats outside. I feel like I've died \n\nThe leaves falling from the trees represent us. We are all leaves that will eventually fall from the great tree of life\n\nI don't want to fall","72":"They’re not even remotely appetizing. They make every soda product taste weird after eating them, they don’t go good with many sauces, they’re burnt often, and the chicken itself sucks.","73":"I will say that even though they are all just sugar, the watermelon flavor is sweet without it being overbearing. Blue raspberry, cherry, and grape are all sickeningly sweet. I don't know if it's the flavoring but it's sweet enough for it to be obnoxious. Green apple isn't any better. It has a weird chemically taste that makes it more unpleasant to eat. Watermelon is still sweet without making it the only thing you can taste for a good bit.","74":"People use the term \"gaslighting\" when more of than not, the person just disagrees with the person who they are claiming is gaslighting them. I rarely see instances of canonical gaslighting (where someone is made to feel they are delusional). Often this is a matter of a difference of opinion that could be solved through discussion or further fact-finding, but calling someone or something gaslighting is becoming a surefire way of shutting everything down so no more conversation can be had. Since gaslighting has an abuse element, this accusation is proven particularly effective, since no one wants to be \"cancelled\" through allegations of abuse.","75":"I mean, think about it..They're like a natural form of edging. When you watch a porno\/look at porn pictures, the cream of the crop is either immediately shown or it only takes a few moment. \n\nNow, games on the other hands...they take a while. You know exactly whats coming, you just don't know when or how, so you end up holding your hard dick and anticipating the inevitable, maybe even stroking it a little bit but not cumming because you want to cum when the sex finally happens. \n\nAnd when it comes, you finally have the permission to cum. You usually have to wait a long time before this happens, thus leaving you plenty pent up.","76":"I understand the desire to do something forbidden brings butterflies in the stomach. But irl, imagine what impact it will have on the person who trusted you. It wouldn't just tear him\/her apart from you, rather it will screw their whole psych.\n\nEverytime such assholes who cheat, they remove one caring and loving person from this earth and replace it with a walking piece of meat who is bitter and just wants to spread hatred against the opposite sex.\n\nFuck you if you don't agree.\n\nEdit: I know it's fake and not a documentary. However, if you head over to r\/cheatingstories, the resemblance of the stories irl and  the porn 'plots' is rather uncanny, even if the process isn't the same, the results are.","77":"Think about it. Blankets can mold to the shape of your head way better, and it’s easier to adjust depending on how you like to sleep. You need more neck support? Stick a little extra blanket in the crevice. Boom, problem solved. Want to cover your eyes? Pull some blanket over them. The possibilities are endless. I tend to lay on my side, snuggle my head in, and wrap my arms around it so they’re warm too.\n\nBonus comfort points if you use a Sherpa blanket. Ditch the medieval pillow and try this tonight.","78":"I get so unnecessarily frustrated with how stupid people are with their ‘memorials’ for people, specifically when it comes to use of public space.  \n\nPutting up cairns, markers or makeshift memorials for people is in incredibly poor-taste and looks super trashy.  “Oh - the person loved this space?  Let’s put up some garbage to memorialize them - so now it’s everyone who visits problem”.  Pay to put up a bench, you fucking selfish asshole.  It’s a dishonor of the memory of the individual you’re memorializing and makes you look like a selfish twat. \n\nThe worst [imo] are balloon releases for ‘lost loved ones’.  What’s about the most disrespectful way to honor someone’s final memory? Release a shitload of plastic waste into the environment that someone miles away has to pick up?  Or worse - some animal will eat &amp; subsequently die a terrible\/painful death. Why? Wtf is the purpose? For the visual? Your dead loved one’s memory is now [literal] floating trash. The best memorial is to not have one at all, especially at the sacrifice of others &amp; the Earth. \n\nEnd rant.","79":"Pretty much what the title reads.\n\nIf someone on internet does not know a simple thing and asks you about it and you ask them to Google it, then you are not being edgy but are being a dickhead to someone who is trying to asking a simple thing.\n\nIf I need a result, I'll Google it.\n\nI need a response, hence I ask you.\n\nEdit: y'all pissed off fucks do prove that my opinion is unpopular.","80":"Yeah you read it. Scrolling through there I really wonder what the fuck these people are on about. Lately I have had this sub pop up on my recommendations out of nowhere. Every time I scroll past a post, that's recommended,  it's a very attractive girl . I'm not saying that we aren't all insecure in our own way but good lord we know you're hot stop posting it on a sub where people can actually garner some support when they are GENUINELY insecure.\n\nStop using freecompliments as your way of getting extra attention that you really just don't need. We get it you look good.","81":"Products like (phones electronics sneakers clothes) and everything else really ...\n\nThey want the people to believe that its the only  feasible way or choice to produce these products is by child labor pennies for wages and quasi slavery ...\n\nBut in my opinion they just want extremely maximize profit . At the expense of human rights overseas ... And American economy here ...\n\nThere is no way the product would cost×10\n\nI know some people are gonna say \"well those kids in sweat shops depend on the 3 dollars they make a month ... Also propaganda ... This cant be the way we operate production on this planet .","82":"4 wheels in the back, a hood that’s five feet off the ground they are exceptionally dangerous to pedestrians and an environmental disaster. \n\nAlmost no one needs them for work and if you generously expand the definition of “work”to include towing a boat or an RV they are still absurdly large for the task. \n\nNot to mention that your average a$$hole that drives one is unable to park them in most parking lots and the owners are generally too overweight\/lazy to park them in the far end of the lot so they just take up four spots near the store entrance. \n\nTl;dr - most people that own giant pickups are total a-holes.","83":"I don't want people to make assumptions about me, so let me preface by splurging a bunch of info about my connection to dating. I'm an 18-year old guy currently searching for an SO to commit to a long-term relationship with. I look just a bit above average, or so I'm told: but I'm no model. I've tried all the dating apps out: Tinder, Bumble, Hinge, etc. and have deleted them all, branching out into IRL dating. I got maybe a dozen likes over the week I tried these, but didn't like any of them back (many were looking for hookups). From there things feel off hard and I had no matches. My experiences with these apps made me want to get this off my chest, as it's something I've seen discussed nearly everywhere yet it's a toxic mindset that almost nobody has taken a stand against.\n\n&amp;#x200B;\n\nPeople in the dating scene constantly throw around the term \"trying too hard\". It's seen as a bad thing if a guy is \"trying too hard\" to find love. For instance, a large populous on dating sites have literally *no* bio. If you do have a nice, detailed bio, you're apparently \"trying too much\". Yeah, actually, the people without a bio aren't trying enough. Why do you think these apps give you 500 characters for your bio? So you can paste the Bee Movie script in? No. It's to tell people who you actually are. I swiped left on almost every single bio-less profile. \n\nNow don't get me wrong, being creepy is a big no-no, but people seem to mix and match the two like there's no difference. If someone refuses to give a girl breathing room, is in her face, and is being pushy, **that's creepy.** However, if a guy is putting huge ounces of energy into making a girl happy, through doing things for her or helping her solve problems, in a way that respects her boundaries, what in the world is wrong with that? Do not mix up \"trying too hard\" with creepy. The former is a disrespectful mindset that is just another thing hurting serious, genuine daters. The latter is a serious problem that should be addressed. **They are very, very different.**\n\nI find it incredibly ironic that the dating scene simultaneously says \"stop trying too hard, you need to look chill\" and then also says \"you'll go for weeks without a match and will need to try really hard to find someone\". So much toxic behavior goes around in the scene already and this is just one piece of it. I could go on about the way specific groups are treated or how harshly judgemental people can be of the fact that others are different, for example.\n\nIt's an incredible effort to meet your special someone. It's a colossal one. It's so difficult that some people have tried their entire lives and never got there. Most people nowadays, especially in my age range, do not have the confidence to get out there and find others, and I can tell you firsthand that building that confidence is exhausting. We don't need people crushing it, and effectively telling you to give up.\n\nPutting effort into something you want is called passion. It may not apply so cut and dry to the dating scene, but you wouldn't criticise a writer for their 400-page draft or an artist for spending a week just on the sketches. And similarly you shouldn't criticise people who are putting hours of effort into improving themselves, getting out there, trying to be the best versions of themselves, and are giving literal ounces of energy to find someone. Those people who do it, you can argue with me if you like, but I think regardless of your justification, it is just such toxic behaviour.\n\nRant over.","84":"I constantly see ungrateful and terrible people who have parents that are wonderful people.\n\nThen everyone is so shocked how this is possible and always feel sorry for the parents.\n\nI never do. The vast majority of time the \"good parents\" unwittingly reinforced or even created the bad behaviour of their children to a very large extent in the first place.\n\nSometimes I wish governments made everyone who is about to become a parent take parenting classes because in a way it can be every bit as dangerous as driving a car, especially if you create an uncivilised idiot or worse that's then foisted on society","85":"I have have grown up with dogs my whole life and we (my family) has never used crates after puppy hood. We let the dogs roam around the house free provided that the bins are out of reach and they never cause any issues with us since all they do is sleep and follow us around the house so I don't understand why people still keep thier dogs in creates. correct me if I'm wrong but not letting them stretch thier legs or do any normal social behaviours among each other just seems cruel to me","86":"getting rid of jeans was the best choice for my personal style i've ever made. the title says it all.\n\nthey get real hot, they sometimes struggle to go in or go out, the colors are ugly and since i got into fashion, they're just something you see so much on your everyday life it just unfazes you to any way to put them together. they do their job of being pants, but they're not fun or groundbreaking to wear.\n\nstarting to wear trousers, tracksuit bottoms, cargos and sweatshorts on my day to day life instead of jeans allowed me to get a better grip on my fashion sense, to see what i'm comfortable in and overall gave me a mad boost in confidence.\n\nin conclusion, fuck them jeans","87":"I love a good steak. I could eat ribeye every day of the week\n\nBut when someone is talking about a steak and says that it's so tender that you can cut it with a fork (usually talking about a filet), that is unappetizing. I don't want a mouthful of mush, I want to bite into a piece of meat.  It should be fairly easy to chew, and not gristle, but it should have some texture","88":"The age old sentence has always pissed me off but in recent weeks more so than ever. Maybe it’s because everyone wants to be seen as somehow more clever than they actually are and reading a book is the crutch they lean on for proof. Maybe it’s just grandstanding opinion for the sake of it. Maybe they just *enjoyed* their time with the book more because they enjoy books more than watching movies. I don’t know. I don’t care. Books and films are storytelling mediums but that is where the similarity ends.  I love books. Books are excellent. They are relaxing and improving and the literary world is an ocean that the author carries you across on his articulate and thrilling narrative ship. I also love films. They do things that books can never do - they vocalise and tell you the story through pictures and audio. \n\nComparing one to the other in terms of which is better is probably possible. You could argue that a film has been poorly made. You could argue that the book is a literary masterpiece. You can SAY one is better than the other in the same I can say that a fine wine is better than a bad grape soda. You can tell me the Mona Lisa is better than Beethoven’s 5th too if you like. Or that the Oasis documentary is not as good as their first album. \n\nBut you’d sound like a pretentious douche to me if you did. Most of you just want to sound learned and bookish and wise and I think you’re trying far too hard. Books are not films any can’t be objectively better in any way. So please fucking stop it with your shit.","89":"I find it crazy that people get so caught up in the same sex marriage debate but no one ever asks why the government even needs to be involved at all. It blows my mind. We don't need the government to make relationships official and private citizens should have the ability to enter any type of relationship or partnership they want. Honestly, do you think the government really cares about your relationship or do they do it to impose taxation laws on people?","90":"I subscribe to several streaming services including Netflix. It seems they're releasing a ton of new shows, but few of them interest me that much. If they do enough for me to watch them, most of the time I lose interest after one or two eps and don't continue. I don't remember losing interest in shows that quickly. Midway through ep 2 of Sex Education and it's boring me. Maybe the whole teen sex comedy thing isn't my thing either...","91":"I finished my undergrad in 2019 and before, during, and after my time in uni I keep hearing countless stories about sexual assaults in frats across multiple universities. Frats tend to create spaces full of individuals who tend to tolerate and condone criminal behaviour and they protect those who engage in it. It’s disgusting","92":"Oftentimes as I enjoy a cheese stick I will bite directly into and Im met with disgust by those who observe me. I find this both insulting and ridiculous. \n\n\nIts a cheese stick not a banana. When else do you peel cheese? Ive never peeled the cheese on my burger. Ive never peeled the cheese in my sandwich. I dont peel the cheese thats on my pizza. No one is peeling babybelle cheese. Why has everyone decided the only right way to eat a cheese stick is to peel it when we literally never peel any other cheeses?\n\n\nFrankly in my opinion its just something most people did as kids and they havent reflected upon it since. Its a weird way to eat. Id honestly find it more appealing to take a fork and a knife, cut the cheese stick, and eat it like that. Sue me. But biting directly into it is how I usually do it.","93":"Atheism is quite well-represented on Reddit (r\/atheism has long been one of the most popular subs) and atheists on Reddit have a particular reputation for being insufferable (and it’s not just the devoutly religious who feel this way, too).\n\nPart of the problem, in my view, is a sort of atheist “cultural appropriation”—as many writers since the 19th century have pointed out, lots of the dominant secular ideologies in modern society have borrowed heavily from religious ideas.\n\nHumanism, after all, originated during the Renaissance in Italy, and the Renaissance Humanists were definitely religious thinkers (if heterodox at times). Specifically they were perennialists, meaning they believed there was a primordial truth (or _prisca theologia_) lying at the core of all world religion. Thus they sought to recover this truth in its pure form without all of the distortions it may have acquired within the context of any _particular_ religion.\n\nAs such, they saw themselves in continuity with the pre-modern past, unlike the Enlightenment philosophers of the French Revolution and afterward, who were essentially ahistorical and sought to build something entirely new while dismissing the past as hopelessly backward and superstitious. The Renaissance thinkers were clearly more _honest_ about where their ideas came from, whereas modern secular humanists often act as though their moral and ethical ideals are completely new, owe nothing to religion and are diametrically opposed to it. Hence why they sometimes come across as insufferably smug.\n\nThe problem with this is that it’s not true. Dawkins-Hitchens style atheists often use [positivist](https:\/\/en.wikipedia.org\/wiki\/Positivism) rhetoric (claiming that the scientific method is the only valid source of knowledge). Those who are also secular humanists claim that humanist ethical theories are derived solely from science and owe nothing to any religious tradition.\n\nBut this isn’t true, for positivism and humanism are fundamentally incompatible. Humanist ethicists generally prioritize things like reducing suffering, maximizing compassion and “being a good person”. But this isn’t science—it’s closer to a mixture of Christian and Buddhist ethics with the serial numbers filed off. (FYI, I’m emphatically _not_ a positivist so I don’t think we should automatically discount anything that isn’t science. There is a lot to admire about this kind of ethical stance. It’s just dishonest to call it scientific when it isn’t. It’s closer to the Renaissance worldview).\n\nA purely _scientific_ (positivist) ethical theory would prioritize maximizing evolutionary fitness above all else. Progressives and humanists would not like such a theory _at all_, because it would more closely resemble Social Darwinism than humanism. (There is a good reason why many, if not most, of the original positivists were also eugenicists and Social Darwinists. It wasn’t just because they were flawed or “of their time”, it was to some extent a logical consequence of positivism).\n\nIn their zeal to attack religion at all costs, the “New Atheists” ended up simultaneously deploying right-wing (positivist) and left-wing (humanist) criticisms of religion, but these viewpoints are ultimately incompatible, which is why nonbelievers are now fragmenting among themselves the way believers used to do over theological doctrines (e.g. “woke” atheists\/SJWs feuding with Intellectual Dark Web types and techbros). It’s kind of a historical irony, honestly, given that neither side will acknowledge the obvious historical parallels. But maybe they should.","94":"Empathy is simply the act of understanding and feeling another person’s pain. Someone without empathy may not understand or feel what another person is feeling, but they can still be a decent human being. \n\nEmpathy isn’t essential to living a normal life, and you could still want to help people without understanding at an emotional level.\n\nHyperempathetic people aren’t all angels, so why do people think people with no empathy are monsters?","95":"Burning the flag of your own country on their land is the ultimate act of freedom. To be able to take the symbol of your government and desecrate it before them. To be able to forsake the symbol of your country so freely, with no consequence. The fact that the people of my country have freedom to this extent gives me immense pride.","96":"This is a more 'off my chest' post but I always see people using them and it's grown to be a trigger? I genuinely cringe when I hear people using them, ironically or not and unfunny either way.\n\nIt always seems to be kids using them which makes it 10x worse; the fact that they will screech these at the top of their lungs and cull other kids to join in on such a brainless trend makes me leave whatever I'm doing and go private. It may be petty, but it's a strong hatred.\n\nThe only excuse is to use them in Twitch Chat but even then it's still just... strange.","97":"In an open field\n\nThe wind carries in its breeze\n\nInternet poems\n\nThough I must post more words to meet the minimum requirements for the sub, it is abundantly clear that only a haiku is a suitable response to another haiku. So please, post a haiku.","98":"I can’t tell you how many posts I’ve seen saying that “red flag if a guy looks at porn” or “its cheating.” The worst part is if a woman touches herself, it’s healthy\/natural, the fucking hypocrisy! The red flag is the insecure woman trying to control you. Shockingly I’m a woman, and I’m not bothered at all when my husband does it, it’s pure fantasy and sometimes I’m not in the mood- win win.","99":"Using a dress for only one occasion is insane. When I was growing up, my mom and I would go thrift shopping and sometimes when there were wedding dresses my mom would say, \"when you grow up we can thrift shop you a wedding dress and I'll alter it for you\". Even if you get it altered by a seamstress that's still less expensive than a new dress. Plus, it's environmentally insane for a garment to only get worn once.","100":"Eating Pop Tarts upside down is the superior way to eat Pop Tarts. You get the frosted side on your tongue instead of the graham side, and it tastes much better.","101":"Honestly I personally don’t like them. Dream is really overrated whats so hot about a sweaty man hides behind a paper plate mask? Dream smp is literally straight men playing Minecraft. I wish we can go back to the time we’re everyone watched aphmau or Skydoesminexradt or Samgladitor, or popularMmos. The new youtuber generations sucks literal balls. But my only opinon is that I think older youtubers are good and put more effort than wanting to just be famous.","102":"&amp;#x200B;\n\n|*Team*|*Played*|*Won*|*Lost*|*Tied*|*N\/R*|*Net RR*|*Points*|\n|:-|:-|:-|:-|:-|:-|:-|:-|\n|***CSK***|***9***|***7***|***2***|0|0|\\+1.185|14|\n|***DC***|***9***|***7***|***2***|0|0|\\+0.613|14|\n|***RCB***|***9***|***5***|***4***|0|0|\\-0.720|10|\n|***KKR***|***9***|***4***|***5***|0|0|\\+0.363|8|\n|***RR***|***8***|***4***|***4***|0|0|\\-0.154|8|\n|***MI***|***9***|***4***|***5***|0|0|\\-0.310|8|\n|***PBKS***|***9***|***3***|***6***|0|0|\\-0.345|6|\n|***SRH***|***8***|***1***|***7***|0|0|\\-0.687|**2**|\n\nNote: If you are unable to set your favourite team's flair, just comment \"Flair (insert your team name here)\" to this post. Mods will set the flair as soon as possible.\n\nAlso it takes time to edit the table everyday. Your participation in the daily match threads makes us feel better. We intend to provide a better,free and more engaging dedicated community for the Indian Premier League which bigger subs like r\/cricket don't. The live discussion thread with Live Chat enabled and with little to less moderation and limits on speech. r\/cricket mods are known for banning users for lame reasons especially in IPL threads.Not to mention they limit the IPL posts to daily discussion threads. r\/ipl intends to solve that problem by giving a better and dedicated community and user experience for all IPL diehard fans like us. You are allowed to post anything and everything related to IPL.\n\n*^(You can express your wish to punch Krunal Pandya as much as you want \/s)*","103":"Last time I polled MI vs KKR , it was neck to neck with kkr slightly ahead . Let's see today\n\n[View Poll](https:\/\/www.reddit.com\/poll\/pvooco)","104":"&amp;#x200B;\n\nhttps:\/\/preview.redd.it\/o1kx72i02op71.png?width=1200&amp;format=png&amp;auto=webp&amp;s=ef49a03adfd7de341a800b303a8edf091e8e6c93","105":"My choice:  Csk, Dc, Rcb and Kkr\/Rr","106":"Who is likely to win today??\n\n[View Poll](https:\/\/www.reddit.com\/poll\/pv1akv)","107":"Whenever Yuzi bowls or fields or someone else misfields off of his bowling, he always looks at Virat Kohli for Validation. I feel this is not a good attitude to play with. He is playing for himself and the team, not for just the captain. I don't see this with anyone else.\n\nHas anyone else noticed this?","108":"Who is more likely to win today??\n\n[View Poll](https:\/\/www.reddit.com\/poll\/pv1b1h)","109":"Which match do you think is the best time to use the 2X booster on IPL season fantasy? How many players should you be considering? And who should we C and VC?","110":"It says that points are given for \"upholding the spirit of the game\", but what actually makes people get more points than 10? Also what did RCB do to get last? \n\nThe whole thing seems stupidly objective (which it probably is).","111":"Who will win today??(fans voting)\n\n[View Poll](https:\/\/www.reddit.com\/poll\/pud35k)","112":"I watched MI - KKR, and enjoyed it, but why are they playing IPL in UAE not in India?","113":"Father of Sherfane Rutherford passed away, he will be leaving the IPL bio-bubble to be with his family in difficult times. #IPL2021 ","114":"Sorry it's not related to the matches, but there is one ad I watched recently during ipl on hotstar about bitcoin \/ stock app where a kid talks to his father about giving chocolates to many people so that he can be in their good books. Basically portfolio diversification. I am unsble to recall the name of the brand. Can someone please say which ad it was ? It was funny I thought. Thanks","115":"Which team is most likely to win this year?\n\n[View Poll](https:\/\/www.reddit.com\/poll\/ptq2tb)","116":"From dream 11 to mutual funds, the ads are so cringy and unintentionally funny. They pay so much money for these players and air time and end up making such basic ans boring advertisements. Watch this video where I speak in a little more depth as to what I mean.\n\nhttps:\/\/youtu.be\/SETdhYG8uT0","117":"\n\n[View Poll](https:\/\/www.reddit.com\/poll\/pto8nm)","118":" \n\n**Delhi Capitals** (Playing XI): Prithvi Shaw, Shikhar Dhawan, Shreyas Iyer, Rishabh Pant(w\/c), Marcus Stoinis, Shimron Hetmyer, Axar Patel, Ravichandran Ashwin, Kagiso Rabada, Anrich Nortje, Avesh Khan\n\n&amp;#x200B;\n\n**Sunrisers Hyderabad** (Playing XI): David Warner, Wriddhiman Saha(w), Kane Williamson(c), Manish Pandey, Jason Holder, Abdul Samad, Kedar Jadhav, Rashid Khan, Bhuvneshwar Kumar, Sandeep Sharma, Khaleel Ahmed\n\n### MATCH NOTES\n\n* **Sunrisers Hyderabad innings**\n* Powerplay 1: Overs 0.1 - 6.0 (Mandatory - 32 runs, 2 wickets)\n* Over 0.5: Review by Delhi Capitals (Bowling), Umpire - KN Ananthapadmanabhan, Batter - KS Williamson (Struck down)\n* Strategic Timeout: Sunrisers Hyderabad - 45\/2 in 8.1 overs (KS Williamson 11, MK Pandey 10)\n* Sunrisers Hyderabad: 50 runs in 8.2 overs (50 balls), Extras 7\n* Over 12.6: Review by Sunrisers Hyderabad (Batting), Umpire - KN Ananthapadmanabhan, Batter - KM Jadhav (Struck down)\n* Sunrisers Hyderabad: 100 runs in 16.5 overs (104 balls), Extras 10\n* Innings Break: Sunrisers Hyderabad - 134\/9 in 20.0 overs (B Kumar 5)\n* **Delhi Capitals innings**\n* Powerplay 1: Overs 0.1 - 6.0 (Mandatory - 39 runs, 1 wicket)\n* Delhi Capitals: 50 runs in 7.5 overs (47 balls), Extras 0\n* 2nd Wicket: 50 runs in 44 balls (S Dhawan 32, SS Iyer 18, Ex 0)\n* Strategic Timeout: Delhi Capitals - 96\/2 in 14.0 overs (SS Iyer 36, RR Pant 7)\n* Delhi Capitals: 100 runs in 15.1 overs (91 balls), Extras 1\n* 3rd Wicket: 50 runs in 37 balls (SS Iyer 21, RR Pant 30, Ex 3)\n\n**Rishabh Pant | Delhi Capitals captain:** We discussed that we had a good first phase, and we are happy to start the second phase this way. We said the same thing about focusing on the process and giving it 100% every day. It's a good bowling performance because we thought 150-160 would have been a good total, so 130-something was a good score to restrict them to. We have one of the quickest bowlers in the world so I think they're great assets to have.\n\n**Shikhar Dhawan | Orange Cap:** I'm enjoying wearing the cap, I'm enjoying the way I'm timing the ball. Not very true, this surface, it stopped a bit, and we had to plan the game according to the wicket. So it was good to go out there and secure a win. I consciously made an effort to increase the tempo and strike-rate, because I wanted to be an impacful player for my side. It was just about the execution. Rabada and Nortje are our gun bowlers. Rabada always gets us the wicket. Nortje has great pace and his game has improved too, so they are troubling the batsmen. Absolutely enjoying being at the top of the table.\n\n### Delhi Capitals won by 8 wkts\n\n[View Poll](https:\/\/www.reddit.com\/poll\/ptnxm5)","119":"13 MS Dhoni\n\n12 K Pollard\n\n7   Rohit Sharma\n\n6   D Miller\n\n6   R Jadeja","120":"9 K Pollard \n\n7 MS Dhoni\n\n5 H Pandya\n\n4 R Sharma, R Jadeja, Miller, Cutting","121":"1 player has tested positive. Delhi Capitals Vs Sunrisers Hyderabad match is still on and the decision on the match will be decided on the 2nd test results of the players. (Reported by Sports Today).","122":"Sanju Samson has been fined 12 Lakhs for maintaining slow overrate against Punjab Kings.","123":"Any thougths on yesterday's match?","124":"Ishan Porel, Markram and Adil Rashid playing for Punjab Kings.\n\nEvin Lewis making debut for #RR .","125":"&amp;#x200B;\n\nhttps:\/\/preview.redd.it\/h5jk72lbhto71.jpg?width=1602&amp;format=pjpg&amp;auto=webp&amp;s=bef1625efcb07a3f54ce709b572546528e15c85d\n\nMost Runs\n\nMost Centuries\n\nMost Sixes\n\nFastest Century\n\nHighest Score\n\nMost Runs in a calendar year\n\nMost boundaries in a match\n\nTruly the boss of T20 Universe!\n\n[ChrisGayle](https:\/\/www.cricwaves.com\/cricket\/213\/ch-gayle\/PlayerDetails.html)","126":"Match analysis - Match 32 is scheduled between Punjab Kings and Rajasthan Royals at the Dubai International Stadium, Dubai on 21st September 2021. The Punjab Kings stand 6th on the points table with 2 wins and 3 losses in the previous 5 matches with a net run rate of -0.368. Rajasthan Royals is one point above Punjab, standing in no. 5 with 2 wins and 3 losses with a net run rate of -0.190. \n\nStrengths (PBKS)\r\n●\tPunjab has the strongest Batting performers in any team of this year. Be it the previous year ‘orange cap’ holder and Skipper KL Rahul, Universal Boss Chris Gayle, Mayank Agarwal, and Nicholas Pooran as the first 4 batsmen to handle the charge\r\n●\tOther members of the team like Dawid Malan, Fabian Allen are highly experienced and can do their part of the job really well.\r\n\r\nWeakness (PBKS)\r\n●\tThe Bowling department lacks big time as they have no such well-experienced bowlers in their squad.\r\n●\tAlthough Mohannad Shami, who was out due to an injury during the Australia tour is expected to come back, apart from him, there is no internationally successful in the spin department\r\n\r\nStrengths (RR)\r\n●\tThe Royals have an explosive overseas batting capability with Ben Stokes, David Miller, Josh Buttler, Chris Morris who can hit big shots and have the match winning capability.\r\n●\tThe team can flourish more with the guidance of Veteran player Sangakkara\r\n\r\nWeakness (RR)\r\n●\tRoyals lack in the Indian members of the team. Although Sanju Samson is a promising Skipper, his form has not stayed consistent. They have to totally depend on the foreign contingent.\r\n●\tEngland Bowler Jofra Archer was ruled out of the tournament due to an injury. Without him, the team’s bowling line-up has a serious problem.\r\n●\tThe team is filled with Youngsters and blindly relying on them won’t stand right for the inaugural champions.\n\n[View Poll](https:\/\/www.reddit.com\/poll\/psctqn)","127":"On one hand, they have a really good group of talent. They have a winning record, but most wins were close and most losses were blowouts.\n\nOn the other hand, every player on the team seems like feast or famine. Maybe the management should have picked have a few players who are always consistent but won't be superstars, allowing others to take risks. Right now, it seems like every player on the team is a risk taker and very few consistent players.\n\nEdit: I'll add: most of their wins came from ABD having a great game. It seems like the plan is : \"ABD or Kohli will have a great game, rest will do what they can\". Also DDP is the one consistent player.","128":"Stephen Fleming confirms Ambati Rayudu's x-ray was clear and it isn't a broken arm. (To Press).","129":"[https:\/\/shopthearena.com\/collections\/mumbai-indians\/products\/mi-essential-940-mumind-nvy](https:\/\/shopthearena.com\/collections\/mumbai-indians\/products\/mi-essential-940-mumind-nvy)\n\n&amp;#x200B;\n\nNavy or royal, I don't care which, but I want these specific New Era caps.  Any sources in the US?\n\nOr even an India source that will ship to the USA.\n\nThanks.\n\n&amp;#x200B;\n\n\\- Michael.","130":"\n\n[View Poll](https:\/\/www.reddit.com\/poll\/prnnic)","131":"Gill\n\nRana\n\nMorgan\n\nRussell\n\nKarthik\n\nNarine \n\n(any batsman)\n\nChakravarthy\n\nFerguson\n\nKrishna\n\nMavi","132":" IPL 2021 Kolkata Knight Riders vs Royal Challengers Bangalore: Dream11 Match Predication, Fantasy cricket tips, Playing 11. KKR Vs RCB Venue, Team, Pitch Report-20 September\n\nRead more:\n\n[**KKR vs RCB Match Prediction**](https:\/\/stackumbrella.in\/kkr-vs-rcb-ipl-2021-playing-11-prediction)\n\n&amp;#x200B;\n\nhttps:\/\/preview.redd.it\/zwlwb9a9cno71.jpg?width=750&amp;format=pjpg&amp;auto=webp&amp;s=6fb041dc894e1e5ffc2ffc0bb8b7545bac5cccef","133":"I know IPL is available in hotstar but they have raised the subscription prices recently and I think it's unfair. Was wondering if there is any other source where we can watch IPL in India.","134":"The NRR system right now makes no sense. A team winning by 10 wickets or 1 wicket makes no difference. It all is on the run rate. According to me, there should be some advantage for a teaming winning by 8+ wickets. Idk what they should do but I feel it should somehow change","135":"Do you guys have any suggestions because neither a VPN with Hotstar nor Sky Sports seems to work","136":"Anyone know if it is there or where to find it","137":"I have difficulty reading Hindi but love listening to hindi commentry, is there any channel for that? Or am I asking to much?","138":"\n\n[View Poll](https:\/\/www.reddit.com\/poll\/pr13cm)","139":"Three months ago, the world's most famous lion, popularly known as 'SCARFACE', breathed his last. He got his unique name from a trophy scar in his right eye, acquired after conquering the Marsh pride in 2012, alongside his brothers, Sikio, Hunter and Moran. Scarface, had called Masai Mara, Kenya, his home for the 14years of his life. 11th September, 2021 marked three months since the world lost this legend [SCARFACE](https:\/\/www.theguardian.com\/world\/2021\/jun\/17\/death-of-scarface-lion-by-natural-causes-in-kenya-is-marked-by-conservationists)","140":"# TL;DR: We do Trivia on Discord every Saturday at 7:30PM ET starting August 14th.\n\nIf you're checking this subreddit so long after Game of Thrones ended, and readying yourself for the upcoming prequel series, there's a fair chance you're quite a dedicated Thrones fan. And so, probably pretty knowledgeable.\n\nWe run a Trivia competition every Saturday on [our Discord server](https:\/\/discord.gg\/gameofthrones) – usually about 60 quickfire questions, from lore to completing quotes to knowing which actor played which character.\n\nSee how you stack up against other trivia experts and come hang out with us! \n\n\n[**You can join the Discord server by clicking here.** ](https:\/\/discord.gg\/gameofthrones) **Trivia is weekly, and the next is on Saturday, August 14th, at 7:30PM ET (12:30AM in the UK)**","141":"Dothraki or Unsullied?","142":"Which character do you think made the worst political decision in game of thrones?\n\nNot including seasons seven or eight here. Nobody was at their best at this point.","143":" I feel like it was such a wasted opportunity to not have Jon say , \"and now their watch has ended\", when they're lighting the pyres of those who fell in the war against the Night King and his army of the dead with all those who survived repeating it in unison.","144":"Did the common people know that Cersei blew up the sept?","145":"Theon has a loss of identity throughout the series. Although he is technically given to the Starks as a hostage at a young age, by the time he grows up, he develops a kindredship with all of them. That said, he does not forget how he believes he has entitlement to his claim to the throne in the Iron Islands at Pike, who are still supposed to be enemies with Winterfell by the time he is released by Robb. He is supposed to have been returned because Robb needs allies against the Lannister’s at King’s Landing, and Theon has sworn loyalty to Robb to help him. Although when Theon returns, he expects his claim to his title to be a shoe in, and moreover, that his father will reason with him on helping Winterfell. When his father shames him for not being a true Iron Islander, Theon feels pressured to then side with his father and actually go to war with Winterfell. Out of fear, he tries to please his father to guarantee his title, and he seems to go against his own conscience by overthrowing Winterfell, especially after killing one of their men, and subsequently the “boys”. \n\nIf you were in Theon’s shoes, and were in the moment where you were just rejected by your father, what would you have done differently? Gone back to Winterfell and explained to Robb that having the iron islands\/pike as an ally is a lost cause? Gone through with taking over Winterfell, but saved the lives of the boys and man you killed? Or something else?","146":"I’ve always wondered if it was a coincidence that Varys spies are called little birds and The Hound nickname for Sansa is little bird. I don’t know if The Hound would have ever heard that term and knows something or is George trying to tell us something by naming them the same thing?","147":"Hi!  \nSince it's my favorite track of my show I wonder what instrument is used to create the haunting tune.\n\nAnd whether it's the same instrument that's also used in the later \"Keel for No Man\" and \"The Red Woman\" variants","148":"Firstly I am so annoyed that they had material to make 12 seasons but only made 8 (I heard this information from a few sources but I don't know if it's a 100% true)\n\nI know it is kinda poetic how Daenerys went mad like her father but I think it would have been so cool if she didn't go mad and was an actual good queen\n\nHow do unimportant characters die in the span of 1 minute but important characters die in the span of 10 minutes it's just so not Game of Thrones\n\nI also don't understand how Arya is so kickass but she stopped fighting the weights and just ran from them but also survived them even though she was outnumbered by like 50\n\nIn the battle of Winterfell the weights were basically just zombies and Not white walkers\n\nHow can and unimportant character die in the span of 1 minute but an important character dies in the span of 10 it's just so not Game of Thrones\n\nIf Daenerys's dragons were like children how come she hardly reacted to viserion being impaled. When I say hardly reacted she froze for a bit and then flew off on drogon and then when Jon snow was seemingly dead she seemed more worried about him not being there instead of her child dying\n\nWhen and where Arya lost her virginity didn't seem to be how Arya is. To me she seemed like the kind of person who didn't care about that and just wanted to kick some ass but then she slept with gendry even though she didn't have any or hardly any feelings for him\n\nHow did drogo not die in real Combat but get an infection but a sickle fall of his horse and die? Biology it doesn't make sense to me how such a healthy strong man dies from and infection that fast\n\nAt the end cersi just sounded stupid to me with all her speeches. To me it just sounded like\" cersi everything is burning follow me\" and cersi being like \"I'm powerful nothing can touch me\"\n\nAnd finally something so annoying I tell everyone. At the end when the red keep fell and Jamie and cersi died after they made a big thing abou it and Tyrion walks in. Uhm excuse me cersi and Jamie, there seems to be NO RUBBLE 10 FEET TO THE RIGHT and Tyrion got through there in no time \n\n(Please feel free to correct or disagree with me on anything I might have misspelled words as I said please feel free to correct me)","149":"Best: the hound (last one)\nWorst: Daario\nLeast noticeable: Beric Dondarrion \nMost Noticable: Daario\nWerent you your cousin: Tommen","150":"- The fantasy elements from the books wouldn't have been trimmed down.\n\n- Dario absolutely would have kept his Lady Gaga look.\n\n- The characters wouldn't have gotten an age lift.\n\n- They would be even more sexualized. Lots of fanservice.\n\n- Robb or Jon would be portrayed as more of a brush shounen hero.\n\n- Cersei\/Jaimie incest would be seen as nothing out of the ordinary.\n\n- Soundtrack by Hiroyuki Sawano instead of Ramin Djawadi.\n\n- Directed by Tetsuro Araki.","151":"During Robert’s rebellion, he proved to have a decent military mind and was able to rally people to fight for what he believed in (albeit a lot of people were tired of the mad king). If he had taken his job as king more seriously (not being drunk all the time, not visiting brothels, and everything else that made people dislike him) how good of a king do you think he could have been?  Would he have been able to maintain support, especially from those who fought against him during his rebellion?","152":"I decided to post this after re-watching a few episodes of S7 and S8 **(not sure how many times now, I've watched episodes in no particular order after the finale),** I don't think there's enough people sharing the high praise they have for the show (including the final seasons). Many people seem to think that half of 100K deliberate review bombs on IMDB is a proper representation of how \"bad\" the majority audience (tens of millions) think the later seasons were, when actually it's just your typical vocal minority.\n\nI'm not looking to change anyones mind. We all watched the show and have our opinions, but I'll definitely say every single argument and reason I've read over the years are awful. I've stayed quiet regarding opinion sharing on the internet (like literally most have) but every single talking point is just **bad** and easily countered. Haven't once read something and said.. Well, you've gotta point.\n\nI started watching GOT officially at the beginning of season 6. Had probably the most viewed GOT YouTube channel uploading scenes between season 6 - 7 next day after they aired. Re watched a lot of clips during that time so understood character doings better than most apparently. Which would explain why I was never caught off-guard by any happenings and think the writing is terrific.\n\nThe writing wasn't rushed at all. People expecting character development of developed characters was only the second most mind-numbing thing behind their lack of comprehension regarding how time passes in the show. Needing to be spoon-fed with sponge bob like flashcards *(2 months later).*\n\n**SPOILER WARNING 1 - 6**\n\n1. Taking the \"Dany sorta forgot about the iron fleet\" description too literal. She was in the only massive war of her life and just lost her longest advisor. It's not unbelievable for her to be laxed traveling to kings landing on a diplomatic approach knowing she can destroy her rivals easily (which she did).\n2. Not comprehending why Jaime relapsed and went back to Cersei. This was probably the least subtle event happening that got a confusing amount of hate.\n3. Mocking the \"sHes MaH qUeeN\" line.  Jon has no interest in the crown. I don't know how much clearer that needed to be. She saved his life and all of Westeros. He's true to his word and loyal, but after some convincing prodding, he did what he had to do.\n4. People had a problem with Arya defeating the night king when she is quite literally the only one written realistically capable of completing the task. A stealthy assassin. People are also overlooking the fact that he allowed her to get so close, simply wasn't expecting the dagger drop. The same people who love to cry about \"plot armor\" (dumbest and most misused phrase in the world btw) wanted a greatly fatigued Jon to defeat night king in a dual.\n5. Brans *contradiction* when he went from \"I can't be lord of anything\" to \"why do you think I came all this way\". I liken this to the Doctor Strange infinity war, knowing the future and not being able to state it since it can change everything\n6. Not understanding why Dany destroyed kings landing. Apart from the fact that she has batshit targ blood, she lost nearly all her organic allies while trying to \"save\" the people who wouldn't even support her. She isn't a pushover, it was beautifully acted how she internally fought with herself deciding whether or not to go \"mad queen\". She didn't want a Cersei surrender after that last stunt. So she burned everything to the ground and was willing to build the better world she saw on that foundation. In her eyes all those people were already traitors.\n\nThere's so many more weird critiques, but I don't wanna make this longer than it is. The only gripe I can lightly support is regarding Danys regenerating army. They arguably should have been a bit more depleted.","153":"main contenders are Locke, Karl Tanner, Janos Slynt, Hast","154":"have been able to recruit more houses to fight for him in his battle against Ramsay? Whether he got named a Stark by Robb or if he was an actual trueborn son but still made decided to go to the wall and have his story from S1 - 5 play out the same, would it have made the battle easier for him having Stark in his name?","155":"I am currently reading book one.","156":"Night King decimates Winterfall and Jon Snow becomes a Walker. A group of 3 escape on Drogon's back- Daenerys, Jamie, and Bran.\n\nJamie talks to Cersei and tells her that they've lost. Cersei smirks at which Jamie gets enraged and stabs her to take over the throne. Now we go to the point where Night King is invading King's Landing.\n\nDaenerys faces off against NK and dies. NK summons the dead and Daenerys becomes a Walker following which Drogon burns her down to set her free while NK watches and smiles. Jamie jumps on NK and NK grabs him by the throat. But then Jamie's face comes off and Arya (who was wearing Jamie's face all along) gets released from his clutch. She then proceeds to stab NK in the gut killing all the walkers except one.\n\nThe last standing Walker is that of Jon Snow, the man who has once again come back from the dead. His eyes are blue and he has now evolved to a full fledged Walker becoming the successor to NK. Jon walks to Arya and apologizes for failing to save everyone. He then gets on Drogon's back and flies off to a self imposed exile, never to be heard from again.\n\nWinterfall has been destroyed so Westeros doesn't get divided. There's no King instead Westeros becomes an Oligarchy with Bran presiding as a Prophet.","157":"In no particular order top 5 - \n\n▪︎Tyrion  (particularly s1-4)  \n▪︎Davos\n▪︎Jamie\n▪︎Brienne \n▪︎ Jon\n\nBottom 5 no particular order - \n\n▪︎Ramsay\n▪︎Joffrey \n▪︎Walder Frey \n▪︎Craster\n▪︎Cersei.\n\nOthers I could include in both categories so hard to narrow down and probably change over time.","158":"Bought the DVD complete series. Finished the series and was disappointed there wasn't much regarding behind the scenes or making of extras. Is there a different version (maybe bluray?) where there are more features than just commentary? I don't expect Lord of the Rings-level of extras, but did want to see more about the special FX than what was offered on the DVDs.","159":"I'dnever watched Game of Thrones before.  Heard a lot about and was one of the most watched shows of  the last decade though the general consensus was  negative towards Season 8.  \n\nI started watching it towards the end of May and just finished on Sunday.  I thoroughly enjoyed the majority of it.  I'd say it probably reached its peak around Season 4, which I'd have as marginally the best.   It declined after that but Season 6 was really strong and would probably be in my top 3, particularly the last 2 decades and the finale actually felt like a proper series finale.   I know many didn't like S7 but I enjoyed it, especially episode 4.  Season 8 was disappointing.   Ending felt rushed and writing for some of the characters was completely different to their arcs in earlier seasons.   The later seasons have more big battles and special effects and like the early seasons for their dialogue, political intrigue and the manipulations.  Did enjoy the payoff for some storylines in s6 and when many characters reunite in s6 and s7.  \n\nI'd read bits and pieces of episodes as I watched and  seen clips of characters so I knew some bits but majority unspoiled.  Knew Ned Stark wouldn't make it to the end but didn't see him dying like that.  The Red Wedding I didn't see coming.  Thought everything seemed too calm for got episode but didn't expect 3 of them to die.   The Prince Oberyn death was probably the most gruesome.  Thought he wouldn't survive but thought he'd had him until the mountain crushed them.  Couldn't figure out who Ramsay was when he kidnapped Theon but then clips in s2 and s3 make sense of it.  \n\n\nI actually thought the first 2-3 episodes of s8 were very good.  90% of the cast are all in the one place and their interactions in s2 where it could have been their last night and it was the last night for some were good   Thought Jon could have been the one to kill the Night King or even one on one fight with the Night King but probably seemed too obvious to the writers and wanted to subvert expectations.  Though in S7 when Arya killed Walder Frey I predicted that she'd be the one to kill Cersei but she'd she Jamie's face so she'd think it was him.  The white walkers did seem rushed.  Normally that battle would have been an episode 9 or it could have been an episode 5 and have the Kings Landing attack in episode 9.  Heard the show could have had 10 episodes but wanted to only do 6.  \n\nThe last 2 episodes were when it got really disappointing, maybe episode 4 but wasn't as bad as last 2.  Danaery's turn in episode 5 just felt out of the blue.  There was no real foreshadowing or explanations leading towards it.  I know she had become more brutal and ruthless as the show went on but she took vengeance out on slavers and butchers, never innocent people.   I first thought she was going to fly to the Red Keep and kill Cersei.  It may have been immoral when your enemy's surrendered but understandably considering the losses Cersei inflicted on her, especially killing her best friend but the areas she was destroying was nowhere near the Red Keep.  Throughout the show it kept referencing and other characters kept saying that she wasn't like her father, the Mad King and then after all that it turned out that she ended up just like him, if not worse than him.   All the character development and journey that she'd been on and how she will protect the innocent just gone.  Varys spent decades trying to get a Targarayan on the throne and then plots to remove her, though he was probably right and Tyrion probably sees that.  Jon likely wouldn't have continued attacking once they surrendered   \n\nJamie had a massive redemption arc from Season 3 onwards and then he just went back to Cersei.   Contradiction from S3 when he said he didn't care about the people innocent or otherwise.  A few episodes before he told Bran he wasn't the same person anymore.  Dont think S8 Jamie would push a child off a window but still.  Did  like him and Tyrion having a final embrace in ep5.   \n\nJon's truth about his identity and real parents had no real impact on the overall ending.  Fuelled a bit of paranoia from Dany and conflict but nothing significant.   I don't see why there's still a nights watch with the ww destroyed and peace with the wildlings.  \n\nSansa had a good ending to her arc with Queen of the North.  Probably had Bran King as what people would have least expected. Showed power corrupts people and those who become obsessed with ruling aren't always best rulers.","160":"&amp;#x200B;\n\n[''People have been trying hit me my entire, but they keep missing somehow''](https:\/\/preview.redd.it\/i5kzgid4ycp71.png?width=550&amp;format=png&amp;auto=webp&amp;s=decd35e891b9f360e8c7952d7c91cadf360ee5a2)\n\n\\-Jamie Lannister S1 E4","161":"I know of house of the dragon but I saw other stuff on YouTube that I wasn’t sure was real or not. Just want to be in the loop","162":"You go there with just as much knowledge of the world and events as you do now. You can bring only one item you own with you (though whatever clothes you have will change to match the fashion of the world)","163":"Anyone else here watch the series through prime video? I'd gotten to the beginning of S5 when all of a sudden I'm being asked to pay to buy the series. So annoying","164":"For me, Stannis (obviously), Tyrion, Robert, Sandor","165":"When he does the oh so famous skull smash, Gregor Clegane says a few lines about how he killed his sister and so on, but the voice doesn't belong to Hafþór Júlíus Björnsson who was the actor that played the character, he is from Iceland, and I've seen several interviews with him speaking English, and he has an extremely thick accent, while the lines spoken in the show are clean and sound American.\n\nAnybody know who was the voice actor? Rewatching the show got me curious.","166":"Am I Dreaming or the opening and ending credits of GOT were inspired by Studio Ghibli's [Castle in the Sky (1986)](https:\/\/www.imdb.com\/title\/tt0092067\/)? The cogwheels, the characters, and even the music!","167":" Jaqen H'ghar is seen with two other men in a carriage being taken to the Wall to join Night Watch; how did he get caught when he is shown to be so smart and powerful later on ?","168":"Obviously it was foreshadowing to Ned’s later execution. But in Ned’s execution, I feel in that moment right before he died that it was wrong for Joffrey to do this to Ned (no kidding!); but was it karma for what Ned did to the deserter in season 1 episode 1? Like yes, when we see Ned as a whole, he’s like, the goodliest man. And the scene of his execution ripped my heart out! But I also think we really forget about what he did to that deserter in that moment of Ned’s execution way back in the earlier episode and perhaps it’s karma. My gut tells me it’s not and it’s just foreshadowing but I’m trying to open the door to theories. \n\nIf the deserter left not just simply out of fear, but because he had seriously seen evil in the flesh. Living may have been more important in the grand scheme of things because he got to warn the others before his execution that the white walkers are real and they are back. Idk, maybe I’m just trying to save the deserters reputation? I don’t believe the reason the deserter chose to live was to warn the others, I think he just got scared shitless (which I don’t necessarily have a cold heart about). \n\nBut also, perhaps the deserter knew that he wouldn’t be able to kill the white walker, so staying and fighting it in that moment would just be a stupid suicide and not worth it\/nor perhaps right either. He obviously knew what a white walker was, so perhaps he also knew he had no chance in that moment of defeating it alone and without fire. If this is true, I don’t think it was wrong of him to run away. You can’t protect the realm if you’re so brave you’re just plain stupid. He was obviously caught off guard. \n\nAgain, I’m not saying a believe these two theories just trying to understand what went on in Ned’s head after deciding to send a man to his death. Ned was such a good man, and you can see it in his eyes that he atleast considers the deserter’s warning in the scene before he executes the deserter. You can tell Eddard may mourn for what he did but he does not regret it. I’m just trying to understand him and why he thinks it was the right thing to do.","169":"Hodor. :(\n\n\nNeedless to say, I’ll be going to bed sad but I was also a bit confused during the door scene. How was young Hodor able to see Bran and was Bran controlling future Hodor the entire time (up to his death)? What was young Hodor experiencing\/seeing during his seizure?","170":"fucking daenerys what was the point of burning the entire city down??? I understand burning the walls with the dragon shooter things sure. I understand burning down the iron fleet and golden army people sure. BUT when cerseis soldiers surrendered and they rang the bell - what the heck was the point of anything that happened after that??? Couldnt the unsullied etc just seige the castle and take cersei? She had little to no protection left. If that scene with jaime and cersei had to happen then couldnt she have just burned down the castle with the few casualties inside the red keep instead of burning down THE ENTIRE CITY??? A city shes supposed to live in and literally killing EVERYONE including probably some of her men??? I didnt even like how cersei died i thought we deserved a more shameful death than that. The writers did everyone so dirty UNNECESSARILY. Somebody make sense of this for me i did not just watch 7 amazing seasons for it to end like this (well 5 amazing seasons and 2 okay ones)\n\nEDIT: k got what i came for with this video https:\/\/youtu.be\/D8ZqKVmkze8\nthanks to the username halleberrrry","171":"Couldn’t write much in my title for sake of spoilers so heres what I wanna say.\n\nI think that Davos would of been a good candidate to finish the Night King.\n\nLike many I am dissatisfied for Arya doing the job, it made me hate her character because all of a sudden the entire show seems to be all about her since she takes out some of the big names.  I was very happy when she took out Walder Frey, that was a great moment for me, and Littlefinger too.\n\nThere could of quite easily been a scene of her wiping out some walkers instead.\n\nAlso like some I am not a fan of Jon Snow killing the night king, it seems to predictable and cliche. However he at the least should of definitely had a long fight with him, which I think should of ended with him being wounded and near death (Jon)\n\nThe reason why I think Davos should be the one, despite not being a fighter or having real ties with the night king, is because of mellisandre and how wrong she always is.\n\nAt first she thought Stannis was Azor Ahai, she was wrong, and secondly she thought it was Jon.\n\nBut in both these scenarios Davos has ended up being the right hand man, could it be Mellisandre overlooked him and he was the one afterall?\n\nLike I said Davos is no fighter, but he must be one of the purest and greatest characters on GOT, he was easily one of my favourites and his relationship with Shireen was great. \n\nI’m not gonna write a full script but basically as Jon is about to receive a killing blow Davos could rescue him by sacrificing himself, but also take the sword from Jon and kill the Night King as he is dying. \n\nAlso Bran should of been more involved because the writing on his character was abysmal.\n\nSo yeh, I don’t think it should be Jon or Arya because one of them fits the shoe to well, and the other not at all. Theres no right answer to who should of done it","172":"I was just thinking about how the idea of Democracy was laughed off, but some form of \"great council\" of newly-minted kings makes a great deal of sense even from a purely self-interested point of view. \n\nWesteros has a size issue, it's just *too big* to be a single feudal state without falling into civil war every few decades; any regional Lord can raise an army big enough to give them a *chance* at power and support whatever spare hair or bastard is floating around at the time. The Targaryens had the \"nuclear option\" of dragons to make rebelling a suicidal prospect but without that it suddenly becomes possible.\n\nSplitting it up and putting some sort of \"Kingly Council\" where even if your Kingdom \/ family is out of favor for a while you can content yourself that some machination \/ patience will put you back on top in time, without the risk of loosing lots of your men (and potentially your entire influence) in a war. \n\nDespite the \"happy ending\" It's probable that after Bran stops ruling via foresight the entire thing falls into the crisis of the third century, with a pretty regular turnover of various lords \"marching on the Landing\" and being proclaimed king until the same happens to them. \n\nUnless he goes all Leto II and becomes a God-King Weirwood.","173":"She has her army, and her dragon. How did you expect her storming king's landing would go down?","174":"Why doesn't Jamie not go with Robert and Ned for hunt being a king's guard, instead he was with Cersie.","175":"I was browsing by new on opensea when I found this NFT of Ser Arthur Dayne, This is just hilarious lol\n\n[https:\/\/opensea.io\/assets\/matic\/0x2953399124f0cbb46d2cbacd8a89cf0599974963\/81256117474940942727473957967005716041076972520879619589532184893497555288071](https:\/\/opensea.io\/assets\/matic\/0x2953399124f0cbb46d2cbacd8a89cf0599974963\/81256117474940942727473957967005716041076972520879619589532184893497555288071)","176":"Change my mind","177":"Am I the only one who - every time I see a White Walker - thinks (every single time) : \n\n“Those are all Crastor’s sons and Gilly’s brothers\/nephews.”","178":"just rewatched the entire series and i cant get over my disappointment on the lack of use of the dire wolves. I wish they were shown more and given more action\/fight scenes. They were too cool not to be given air time. Like showing Grey Wind and Ghost in any of the battles. Or maybe bringing back Nymeria to fight. Also curious to know if they were presented better in the books - im about to start reading and i want more of them","179":"Wanting to read the books, has anyone got the read order?","180":" Lately I've been having a bit itch to rewatch the show as it's been some years since I last did. But I happened to get the first book from the library and thought it wouldn't be smart to do them both at the same time. I have a preference for the show but if the first book brings something special I'll probably finish before i start up the show again. \n\nThanks for any help \n\n(Same post as before just with brackets)","181":"My sister (a big GOT fan, read all the books, etc) and I (casual viewer of only the TV series) got into a heated debate the other day, after she said that the Game of Thrones series was character driven, but I disagreed, arguing it was the world events that were the main focus of the plot, and the characters the series followed happened to be the best way of exploring and explaining the series of events.\n\nOf course, especially given her personal investment in the characters, and the depths of lore she knew about all the families etc, meant she found this a rather hard pill to swallow...\n\nSo after a lot of arguing about it, I jokingly said I'd ask reddit and see what others thought!\n\nIs GOT character or event driven?","182":"Im always wondered. Its the worst weapon for an assassin!\n\n&amp;#x200B;\n\nhttps:\/\/preview.redd.it\/cux8b9bfzvo71.jpg?width=401&amp;format=pjpg&amp;auto=webp&amp;s=96b880026f7de20ef3b8a9335aff07165e9ca12f","183":"&amp;#x200B;\n\nhttps:\/\/preview.redd.it\/q8rwu2j7ero71.png?width=1280&amp;format=png&amp;auto=webp&amp;s=facf4168b6d8f160334923e962b00c02f0889a45","184":"Read only if you have watched the ENTIRE series.\n\n&gt;!About 26 minutes in Jon is fighting with the white that came alive in the middle of the night. When he grabs the lantern from Mormont's hand, he yells in pain. Is this an oversight in that Jon would not be effected by heat if he is a true dragon like Daenarys?!&lt;","185":"Please excuse me if this has been addressed here before, I'm new.\n\nWhat I am looking for is a way to seamlessly watch or listen to an audio book version of individual characters through the full storyline (every Arya chapter all in a row for example). Obviously this could be accomplished by skipping through the books and tagging all the chapters for a given character but I personally prefer listening or watching. Does anyone here know of any compilations of this sort? Thanks!","186":"&amp;#x200B;\n\n[ \\\\\"A Lannister Always Pays His Debts\\\\\" ](https:\/\/preview.redd.it\/5acxqw6hhko71.png?width=2800&amp;format=png&amp;auto=webp&amp;s=fe0e79e59eae071e29f07a7a5df6c1bbc1d56e8e)","187":"The whole incest shit. \n\nI wouldn’t mind it if they only used it as they did in the first episode, with it being a sole reason to progress the story. But what I get hung up on is this weird acceptance of it afterwards. \n\nLike when Jaime says “we don’t choose who we love” to brienne, and at this point we’re actually kinda supposed to like Jaime’s almost redeemed character so that message was always kinda weird to me. \n\nOr at the end with Dany and Jon. Like, had Dany not turned bad, I think they would’ve tried to make that relationship work and honestly, they still did try before that even with the knowledge that she was Jon’s aunt. \n\nIdk, anyone else?","188":"Your finally the ruler of westeros. A foreign invader comes along to conquer your kingdom. Plus, you get knowledge of the white walkers. How would you handle the situation?","189":"I only started watching the series 2 months ago. I wonder if anybody has the same problem as me. Some non-POV characters are introduced early on as side characters. When they have a more prominent role later, I have already forgotten when they're first introduced and therefore miss a lot of background information. I therefore have to spend some time going through those characters on GOT Wiki. I guess it also doesn't help that I only watch GOT while having dinner.","190":"Oh my god, what an amazing episode\n\nDrunk Cersei is an absolute queen, her interactions with Sansa were gold\n\nHound and Bronn are badasses \n\nStannis being the Mannis, nuff said\n\nTyrion leading the army\n\nTywin and Loras riding in and mowing down Stannis’ army\n\nBUT MOST IMPORTANTLY, THE EXPLOSION WAS *CHEFS KISS*","191":"When Stannis's wife calls Jon Snow a bastard of Ned Stark, Stannis replies: \"Perhaps. But that wasn't Ned Stark's way.\" \nDoes that mean Stannis knew something about Jon's parentage?","192":"On my second or third rewatch and just got to 5.2 The House of Black and White. The conversation between Dany and Barristan Selmy where he encourages her not to kill a Harpy and she says \"I am not my father\" and he responded \"thank the gods for that\" hits a lot different knowing how it ends","193":"I’d like to first say that this is my personal opinion. If you didn’t like how Jamie’s story ended, that’s your right, and I hope we can disagree respectfully. I just want to make my case as to why I like the way his storyline concluded. For Jamie, I will admit the end of his arc is rushed, as he decides to ditch Brienne for Cersei in the span of just one episode. But I think his choice to go back to Cersei at the end is consistent with his character throughout entire show. Almost every single choice he makes in the show, he makes for his family, mainly Cersei. Trying to murder Bran, killing his cousin, attacking Ned, fighting on the Lannister side against Daenerys’s army, etc. His entire moral code is to protect the family name and Cersei, no matter how ruthless he must be. After he meets Brienne, the struggle of his character is whether he wants to change or go back to his old habits. And in a way he does change… at first. He risks death fighting the White Walkers at Wintefell (which by the way he realistically should’ve died because he only has ONE HAND). And while he kind of loves Brienne, being with her just doesn’t feel right to him. He’s loved Cersei his entire life, there’s no way for him to love someone else the same way. This causes him to relapse and go back to his old habits, which ultimately lead to his downfall. If you were interpreting his arc as him definitively becoming the good guy, then I can see why you’d be disappointed. But I  personally find it so much more powerful to witness what’s almost like a Shakespearean tragedy of a man who wanted to change, but couldn’t overcome his strongest desires. I find Jamie’s failure to change to be realistic and very human.","194":"Ok. Dany just burns the red keep. Jon is ok with the incest. Dany is no longer barren. What happens next?","195":"I honestly started the finale thinking absolutely nothing of it but probably a huge cliffhanger (There may still be one but I’m like thirty minutes in right now typing this at 4 am). Nobody could truly prepare me or warn me for what came in the first TWENTY MINUTE of episode ten in season six. The entire kingdom being killed along with the queen and religious leader (bear w\/ me here explaining), the young king committing suicide in SECONDS without hesitation (I honestly screamed but also laughed at how sudden it was), the queen admitting to liking the feeling of her brother inside of her, the woman being left tortured chained up (I don’t know if she was being raped or being turned into a quiet soldier. I’m still lost there), and THERE WAS JUST MUCH AT ONE TIME. It was literally everyone being killed and murdered along with all the secrets being unfolded openly to everyone immediately in a short matter of time.\n\nAs I’m typing this, they’re discussing with the grandmother about getting vengeance with Cersei and I sure hope this means bring Daenerys into things to end her. She’s the only person I can think of that can do it in a instant, as they said “fire and blood”.","196":"So, I'm currently working on a Game of Thrones\/Dungeons and Dragons fic idea where a trio of meteors months before GoT's canon causes a second Age of Magic, with thirteen people being blessed as 'Champions' at first, with one champion per region to have things spread out. I have Jon Snow as a Ranger, first hunting Beasts and eventually Undead; Gendry is an Artificer, who specializes in making enchanted Armor; Daenerys is a Sorcerer thanks to her Targaryen blood, which fuels her spells while Viserys fantasies about using the power himself; Marwyn, after discovering he's a Wizard, flees Oldtown to keep from being silenced; Euron returns to the Iron Islands as a Warlock of the Drowned God (an aboleth or Kraken) who seeks to turn the Ironborn into a new, amphibious race; And The High Sparrow quickly gains renown as a Cleric of the Seven, his blessings causing him to start bolstering the Faith Militant.\n\nHowever, I still need a Barbarian, a Bard, a Druid, a Paladin, a Fighter, a Rogue, and a Monk 'champion', but have trouble deciding who to have be what classes. Do you guys have any recommendations? The only restrictions is that they can't live in the North, Essos, the Crownlands, the Riverlands (for the High Sparrow), the Reach (for Marwyn), or the Iron Islands. Having someone from North of the Wall is needed, though.\n\nEDIT: To help clarify, mainly looking for the Champions to be living in the region at the time, but they don't have to originally be from the region. The High Sparrow is a key example for this, but Domeric Bolton, someone I considered for Bard, is another example.","197":"GOT has been out and concluded for long enough now.  Can the mods change the sub rules about spoilers warnings at this point so we can discuss everything freely?","198":"Daenerys\n\nJamie\n\nCersei\n\nArya\n\nTyrion\n\nStannis\n\nRobb\n\nMargery","199":"…are there supposed to be subtitles when the Jason Mamoa dude’s people are talking?  My version on my “special” fire stick is just tribal dialogue so I think I missed some important stuff. THX.","200":"Remus was the best DADA teacher","201":"Idk if it’s because I grew up with it so it reminds me of my childhood and less stressful times or something else. My friends called me “childish” for this, so I thought I’d explore this amazing phenomenon in this sub lol.","202":"The dementors can be driven off, en mass, by one spell capable of being cast by a 13-year-old. A spell nearly every single member of Dumbledore's Army, the Order of the Pheonix, and (presumably) the reformed powerful Death Eaters can cast. Sure, it's supposed to be \"ridiculously complex\" but seems like a lot of people can do it. Since we know from the 3rd book that a Petronus can travel across water, all a mass breakout would take is one small boat of powerful wizards (or maybe even just one wizard) sending a strong Petronus into the fortress to drive the dementors away.\n\nBut why would good wizards, capable of producing a Petronus (JKR has said only good wizards could cast it), break people out? The Ministry has routinely thrown innocent wizards and witches in Azkaban without trial, many of them dying there. Breaking them out isn't out of the question in that world.\n\nupdate: it doesn't even have to be related to the Dark Arts. We also know that other governments exist and could easily have prisoners in Azkaban that they would want out. Imagine a wizard Putin who can breakout anyone they want from British prison they want at any time.\n\n[https:\/\/harrypotter.fandom.com\/wiki\/Azkaban](https:\/\/harrypotter.fandom.com\/wiki\/Azkaban)","203":"So I was recently watching the half blood prince, and i found it hard to watch Dumbledore drink the water while he was begging harry not to give him any more, did anyone else feel this way?","204":"(I know this has been done before, but here's my version of an AI written Harry Potter chapter! It was super fun to make, so I wanted to share it with you guys. I'm sorry if this does not belong here, though. Made with botnik.org)\n\n***Harry Potter and the Twiddling Knee Potion***\n\nChapter 3: The Uneasy Wolf Hand\n\nHarry Potter woke in the morning. His head had broken again, but this time with magic. Ron was a bad witch, but Harry understood now: it was only a matter of time until Voldemort would scream at Dumbledore, and wave his wand at him. Such was a normal morning at Hogwarts.\n\nHermione Granger, the girl of the books, was more open now. She was hiding behind the cloak, and whispered, \"Why isn't my homework done yet, Ronald?!\" But Harry couldn't hear it. He was busy with magic and Professor McGonagall, so he was not there.\n\nHarry, Ron and Hermione went to Hagrid's Hut to visit Hagrid. It was always Hagrid. Then he said, \"But these aren't my words,\" with a crushing noise. \"It was just me!\" he exclaimed. Harry didn't understand. But he was still Hermione's best friend. The wind was yelling \"whatever,\" happily behind the ministry.\n\nThe time is already faster. It was almost a school day, and everyone was ready. Until they weren't. That's when Professor Dumbledore said \"No, Harry,\" and flew away on his broomstick. The smoke from the pipe in the Common Room had joined Goyle, so Ron got an idea; \"Hermione is back!\" he exclaimed, his mouth full of magic. \"About time!\" yelled Harry.\n\nLord Voldemort was growing weary of waiting. So much waiting. He took a sip of the pumpkin juice and thought, \"If only young Draco understood,\" but Harry was stupid, he thought. It wasn't very cool, but he tried to enjoy himself anyway. Draco was also jealous, but only when having breakfast.\n\nIt was morning again. The sun had vanished behind the sun, and it was finally the weekend. Ron was busy. Hermione shrugged, \"At least Professor Snape can do it!\" she said in a singsong voice. Harry agreed, and they flew off to Quidditch.\n\nQuidditch is a game, it was a game that had balls. Harry was tired, and moaned, \"This time, Voldemort won't catch me,\" but it was too late for Harry. He had already seen Ron eat while looking at Hermione while grinning slyly, and Hermione wasn't having it. She had the book, and she slammed it on the table. \"You can't be serious!\" She cried.\n\nHogwarts was angry, but only just. Harry and his friends, Dobby, were waving their wands at Malfoy. Draco Malfoy was not only a Slytherin, he was also a pupil at Hogwarts. Harry hadn't realized this until now, for Professor Snape had caught up to them; \"Harry Potter looks sweet today,\" he spluttered furiously. Dobby felt right at home.","205":"I was listening to GoF and in the shouting match between Fudge and Dumbledore regarding the dementors switching sides the moment Voldemort asked them to.  I wondered firstly how does one communicate with dementors and secondly what would Voldemort have as a patronus?","206":"Order of the Phoenix is a good movie","207":"Im re reading Harry potter for about the 10th time and in the philosophers stone, one part always cracks me up. \n\n\"He thought of Hagrid, expelled but allowed to stay on as gamekeeper. Perhaps he could be Hagrid's assistant. His stomach twisted as he imagined it, watching Ron and the others becoming wizards while he stumped around the grounds, carrying Hagrid's bag. \n\nDon't know why but i always burst out laughing reading that. What's everyone else's small funny parts of any of the book's?","208":"A fair number of people die throughout the Harry Potter series, if you could save someone (at the cost of killing someone else off) would you do it? And which characters would you save\/sack off?","209":"The operation of the Mirror of Erised in the first book sets up the Deathly Hallows in the last book: Only one who does not desire to use the Sorcerer’s Stone for their own gain may obtain it through the Mirror. And likewise, one must not desire the power of the Hallows in order to master them.\n\nDumbledore was the closest after Harry to wielding all the Hallows. He was able to wield the Elder Wand successfully (without being murdered in turn) because (I assume) he won it as the byproduct of saving others from Grindelwald. But he could not master the Resurrection Stone because he desired to bring his sister back (also it was cursed). It seems like he was able to use the Invisibility Cloak, but it was not meaningful to him, as he could become invisible through other means. As he said, the Cloak just rounded out the Hallows. But it was not passed down to him. \n\nOnly Harry was able to master the Hallows by obtaining them without desire for their powers. He won the Elder Wand by saving others from Voldemort. He mastered the Resurrection Stone not by trying to bring people back to life, but by preparing himself for his own death. The Cloak of Invisibility was passed down to him from his father (through Dumbledore) as in the Bard’s Tale. But he did not use the Cloak to become wealthy as Xenophilous Lovegood assumed the wearer would. \n\nJust thought this was neat and wanted to share.","210":"I think the films are great in their own way. The cinematography, score and acting are all pretty competent. I think a lot of book fans wished that the films were longer so the can fit more source material in there. Hallows was split into 2 films, a wise decision imo, but even then some material had to be cut. If you had to choose one film out of the 8 being adapted, which one should’ve gotten significantly more screentime to add more content in? I think the answer has to be Goblet of Fire for me. Of the 8 films, I think Goblet was the least cohesive story wise. Fleur and Krum are underdeveloped as champions. The joke shop plot line was dropped so it created an error in the 5th film. The mystery’s were cut to only one central mystery. The subplot of Barty Crouch madness plot was underdeveloped. Mrs. Weasley and the Dursley’s were cut entirely from this film. Lastly, the Sirius Black character didn’t make an impactful appearance in this film as in the book he comforted Harry after the Voldemort resurrection. I think this film also has the biggest pacing problems with Chamber of Secrets a close 2nd as the film quickly skips by scene by scene with little breathing room. The students arrive at Hogwarts 15 minutes into the movie.","211":"I remember when I was a kid, reading the books, and he bought his cauldron or was using it, I always thought it was one of those big ones you see witches around. It wasn’t till a few years later when they made the movies that I realized of course it would be a miniature one.","212":"I took the sorting quiz and am in Hufflepuff. I always wanting to be in Gryffindor but deep down I knew I was probably really a Hufflepuff at heart. I think I just assume Gryffindor to be braver. Fellow Hufflepuffs or others, can you give me some of your reasons why you love the Hufflepuff house. Any favorite characters from that house? I do really love the colors. 💛🖤","213":"After watching GoF again, it made me realize how cringey the Yule Ball is. Every little thing about it is just maddening, some examples being the outfits, the dancing, the music, and the fight between the Trio.","214":"In the third book Cho was introduced as a 4th year which would have made her a graduate or an 8th year during the 7th book, but she’s brought into the 7th book having already been at the school all year","215":"It was announced that the HP films are going back to Peacock after only spending 6 weeks on HBO. They'll be on Peacock by October 15.","216":"I totally loved it. The whole series is so so good, it's one of the best things I have ever read\/experienced. I know how much I missed out on since I should have read it way earlier..but I am glad that I did it now. After reading the books for a month, now when it's over, I kind of feel empty. I felt as if I was the part of the story and that I was living in the Harry Potter world, and now that it has ended, I feel lost. And I do not want to read anything else for I just want the feeling of finally finishing it or knowing the whole story to sink in. Is there anything else related to Harry Potter world that is worth knowing that I could read next\/listen to\/watch? Also, people know a lot about Harry Potter and Hogwarts like about Teddy Lupin's life or Draco Malfoy's wife or about Ginny which was nowhere in the book. Is there something else that I should be reading and don't know about?\nThanks for reading..","217":"Runner-up  maybe is the inferi attack on Harry and Dumbledore. Plus experiencing a weakened Dumbledore \n\n\n Personally i found the Battle of Hogwarts to be... not so frightening for some reason... it was too climatic &amp; Harry was surrounded by friends","218":"So Harry using crucio and imperio was a mistake by JK imo - even if both justified. There should have been a moral rationale that Harry and the guys wouldn’t stoop to that level (same with McGonigle using it on Carrow, etc) \n\nThoughts?","219":"Okay, this is a theory I have. And I wonder if anybody has similar thoughts.\n\nKendra Dumbledore was implied to be a Native American. We know she was a Muggleborn and really secretive, keeping a low profile away from her neighbors. Aberforth claims she was the one who taught her brother to be a pathological liar and master manipulator. \n\nNow, the first Fantastic Beasts movie discussed something vague about how American wizards have a rather hostile relationship with their Muggles because of some witch-hunts led by American Muggles in the past? (Seriously, the Fantastic Beasts series were really vague about everything) The only American we know in the original series was Kendra Dumbledore, who also happened to be a Muggleborn, so I automatically connected the dots and assumed that was what had happened to her Muggle family. I had a theory that her Muggle family was the target of some kind of a witch hunt, but since she actually was a witch, she survived and other family members didn't. This would also explain why she left her home country and never went back.\n\nThis would mean Kendra Dumbledore watched her family get destroyed by Muggles TWICE and possibly handed down her trauma to her son Albus, which could have been a factor in his decision to support Grindelwald briefly before he came to his senses.\n\nThoughts?","220":"I really don’t understand this, she just goes out with ron, and ron doesn’t like her anymore and won’t man up to just tell it off. Like what did she do?","221":"In DH when Harry ultimately decides to rip his hair out for the 7 potter scheme is one of mine. I feel as though the movies did that part a bit better by having Hermione rip it off for him.","222":"I am a lifelong Harry Potter fan, the books and movies were a huge part of my childhood, my mom read the books to me from a young age and then I read them myself and always went to theaters for the movies and watched them all the time at home. Then from highschool to the end of university I probably only did a full movie marathon twice in nine years. Then one random day about 6 months ago i had the urge for a movie marathon and watched all 8 in three days, and then i started the audio books (and joined this sub because of how much i enjoyed them) which took about 5 months to listen to because i mostly used it for my commute, and that whole five months I probably averaged watching one harry potter movie a week (sometimes more, sometimes none) and now i find myself re-listening to the audio books (on the first one) and still in the mood to throw on the movie as background a lot of the time. Tell me about the last time you caught Potter fever and how long did it last for?","223":"Harry Potter as POC\n\nI’ve noticed in the law few years a trend to illustrate or write fanfics or head canons where some of the HP characters that were originally written to be white are now POC. \n\nAnd whilst I do like the idea of Hermione as black and\/or Jewish as it adds to her character and her experiences. I find it confusing why people portray Harry as Indian. \n\nMy reasoning as follows is that Harry himself is meant to resemble two people in the series; James Potter and Voldemort. So whilst if I stretched my imagination I could picture Harry as POC I have to take that into account. Because to me there is no way on earth that James Potter could be a POC, he is the spitting image of privileged white boy with a fortune that he flaunts. To turn him POC as I see people do — is to add something to his character that makes him more sympathetic when in reality he is meant to be a privileged bully turned good down the track. James Potter is a character that like Draco isn’t meant to have experienced any form of suffering in life — James’s struggle in life is to see beyond his privileged scope and become a good man which he does eventually which is how he wins Lily over. \n\nSo if I were to believe Harry was a person of colour it would have to be through Lily not James though that causes problems as she is a fair redhead. My additional reason as to why I can’t see Harry as a POC is because symbolically Harry and Tom Riddle are meant to strongly resemble each other. \n\nAnd I definitely do not think Voldemort should be a POC. So I were to change Harry’s colouring that takes away from the symbolism those two share and also to Snape. I think that line near the end of Deathly Hallows about the three of them being lonely boys who found home at Hogwarts really ties them all together as three pale, skinny dark haired boys. \n\nAnyways that’s just my thoughts on the topic — I am curious as to what is everyone else’s thinking on the matter.","224":"In the movie Harry has a shard of the mirror from Sirius’ house but it doesn’t explain how he got it or why.  And Harry has Belatrix’s wand so why didn’t Hermione use it at the bank?","225":"Don't you just love the smell of new harry potter books? I got the book Prisoner of Azkaban brand new and i've spent 20 minutes smelling it. IT SMELLS SO GOOD!","226":"This detail in the books was left a bit vague, with the only detail given being Slughorn saying it was worth perhaps 100 galleons\/pint. The notion I got from that exchange was that Aragog probably would yield &gt;1 pint of venom, but it's left quite unclear.\n\nSo, I got curious and gathered enough info to take a stab at how much venom that might actually be. Obviously, quite a few assumptions are at play here and it's all in good fun, but I couldn't find anyone else having done this online, so I thought I'd share my work.\n\nFirst, I was able to find a paper on venom yield in [Coremiocnemis tropix tarantulas](https:\/\/pubmed.ncbi.nlm.nih.gov\/21544186\/), of around 0.5-1.0 mg. I'll use 0.75 mg.\n\nThis species of spider appears to be around 3 cm in total length, roughly speaking, which I gleaned from a few sources.\n\nWe know that a typical acromantula is the size of a cart house, which appears to be roughly 7.5 feet long, and that old specimens, like Aragog, can be around 15 feet long (or maybe 18? I used 15). These dimensions are approximately 75x and 150x the length of our sample spider.\n\nSince volume increases with the cube of length, we can then conclude how much more venom acromantulas would yield, assuming they are alike to our sample spider proportionally.\n\nTypical acromantula of 7.5 feet long has 75^3 = 421,875x the volume for 316,406 mg of venom yield.\n\nA large acromantula of 15 feet long has 150^3 = 3,375,000x the volume for 2,531,250 mg of venom yield.\n\nI couldn't find anything on the density of spider- or other venoms, so I'm assuming it's approximately the same density as water, which likely wouldn't be too far off anyway. Also, in case this causes any confusion, I'm using British pints for obvious reasons.\n\n\nThis means a typical acromantula might produce 316.4 mL or about 0.56 pints of venom, worth around **56 galleons,**\n\nwhereas a large acromantula, like Aragog, might produce 2531.3 mL or about 4.45 pints, worth around **445 galleons.**","227":"I remember reading the book (in 2007) and being incredibly disappointed that Voldemort didn't appear... i thought he would be guarding his Horcrux in that island grotto where Dumbledore and Harry traveled too. \n\nI will say looking back,  it was probably for the better.  It drummed up anticipation for his return in the 7th book.  Having 2 battles throughout.","228":" One of my main headcanons of after the war is that Draco is the only survivor of the Slytherin Class of 1998. Everybody else got killed by the families and friends of the people the Death Eaters had killed after the Death Eaters and their toadies got off yet again.","229":"As far as I know Rowling’s never addressed this and I don’t think we ever see a known animagus cast a patronus. The closest we get to any sort of hint of this being the case that I know of is James’ animagus form being a stag and Lily’s patronus being a doe.","230":"We know that Fleur worked at Gringotts during the fifth book where she met Bill. Is it possible that she can mesmerize the goblins there like wizards? Are goblins immune to “Veela charm”?","231":"It was Sirius for me.","232":"I love to write and Harry Potter is definitely one of my favorites. Tell me some stuff and I’ll write you a custom paragraph. Confused? Here’s my example\n\n“Jenna, who had her dark caramel hair pulled up in a tight ponytail was watching Mr. Weasley tell off on Fred and George. A big smirk on her face was a giveaway that she knew what the twins were doing with the Ton-Ton Toffee before they had came in the Dursley’s fireplace. Noticeable dirt on her hands and face lead for Harry to think she had been tending to the Weasley’s garden.”\n\n-The Goblet Of Fire","233":"Like the marauders and Snape made the marauder's map and spell\/curses respectively","234":"If so, how do you like them? Are they worth the price?\n\nIf not, what do you think about these scent descriptions? Do you think they sound accurate in terms of what each one would actually smell like? If not, what scent notes would you choose for each one?\n\n* **Hogwarts notes:** lemon, cedar leaf, cashmeran, tonka, guaiac, oud, bamboo, patchouli\n* **Slytherin notes:** dark berries, camphoraceous, lemongrass, cardamom, cinnamon, clove, orange blossom, leather, fir, sandalwood, cedarwood\n* **Gryffindor notes:** galbanum, bergamot, eucalyptus, cade, lavender, leather, myrrh, amber, smoked mahogany, teak, sandalwood, cedarwood\n* **Ravenclaw notes:** grapefruit, lotus blossoms, spicy pink pepper, nutmeg, frankincense, oud, amber, white musk\n* **Hufflepuff notes:** pomelo, blood orange, mandarin, lemon leaf, cassis, tea accord, musk, amber, black pepper\n\nLink: [https:\/\/www.pbteen.com\/products\/harry-potter-scented-candles\/](https:\/\/www.pbteen.com\/products\/harry-potter-scented-candles\/)","235":"My favourite is VERY easily Harry. He's a much more layered character than the two of them and is the most fleshed out character in the series. The introspection JK did in OoP is honestly what makes it my favourite book. And I also like how he develops in that book as well. The other two for me just weren't that interesting. They both felt like caricatures a lot of the time. And while that would be fine if the books delved more into their character, that didn't happen.","236":"Hello everyone, I've just have seen a harry potter fanfilm, and i didn't like some (maybe a lot) changes in the canon but really loved seeing the Wizarding world from another perspective... Anyway I'm looking for more fanfilm can you people recommend me some of the ones you have seen 😅😅😅😅\n\n\n(sorry if my redaction sucks, doesn't have a perfect english)","237":"So we all know what happens when you get bit by a werewolf but what happens if you bite a werewolf? (If you survive after biting them)","238":"I suppose some place has to feel like home, might as well be Hogwarts.","239":"Okay, so JK has said that wizards used to do their \"business\" on the ground and just use magic to clean it up, because, I am assuming, bathrooms weren't common in the wizarding world, right? But... when Salazar built his secret chamber there had to have been pluming in the school because otherwise if built later on the Basilisk would have been found... \n\nAnd if the entrance was always in the girls bathroom, did that mean they already used bathrooms when the school was built? \n\nPlease forgive any mistakes, English is not my first language :)","240":"Excuse me, but Sirius just died. Must we immediately play the fun music?! \n\nOOTP was probably my favorite book in the series, but the movie is kinda blah the more I watch it. (Like any respectable fan I’ve had the movies on repeat ever since HBO got them back 😂). \n\nHBP is my favorite movie. Perfect balance between light and dark, and the end credits aren’t all bubbly and happy after Dumbledore dies. They at least start with appropriate music.","241":"Snape said to Bellatrix and Narcissa in HBP. \n\n“I am pleased to say, however, that Dumbledore is growing old. The duel with the Dark Lord last month shook him. He has since sustained a serious injury because his reactions are slower than they once were.” \n\nOn one hand, I believe their duel actually shook Dumbledore cuz he was of age fighting and doing his best to keep up with a much younger man. Also, it was Voldemort trying to kill him and Dumby had to defend himself, Harry, trap Bella and alert the ministries all at once. That’s some extreme multitasking I have never dealt with before and that would definitely shake me.\n\nOn the other hand, Dumby seems so superhuman. I remember Harry’s observation of how agile Dumby was despite his old age when they swam in the cave. At the same time, I am certain the duel wasn’t the first time Dumby faced a matter of life and death situation. \n\nThoughts?","242":"At one point Mad Eye (Barty Crouch Jr) looks at Harry and says, \"Nice Socks Potter.\" Harry was wearing robes. Does this mean Mad Eye\/Crouch Jr spent the year looking at naked kids? Also, wouldn't have Dumbledore been complicit? 😱","243":"I just watched the second installment of Fantastic Beasts and absolutely loved it. As I'm going through the related posts and youtube videos, I'm surprised to see many commenting it ruined the franchise.\n\nPersonally, I felt the second one had a lot going on while the first one was bland in comparison. The story isn't 1D anymore as Dumbledore and Grindelwald got into the action in addition to Newt's storyline.","244":"Now I know this is a subreddit where it's illegal to have opinions so don't lash out on me or anyone else! No such thing as a wrong opinion.\n\nExcept if you say you like Umbridge. Then your opinion is wrong.\n\nAnyway, spoiler alert for every book\/movie in the series! I'm really curious as to what your favorite scene of the entire series is.\n\nI'll go first. My favorite chapter is Prince's Tale, sure, but my favorite *scene* is the Battle of Hogwarts. The end of it, to be specific. When Harry and Voldemort are circling each other in the Great Hall and Tom Riddle meets his demise. What I love about this is that Harry, after everything the Dark Lord had done to ruin his life, offered him a second to try to feel remorse. And he calls him by his real name twice, which in my headcanon was Harry trying to show Voldemort that whatever he did, he would never be anything more than a broken person with no sense of love, that he'd never achieved anything more than to kill innocent people and build up an army of slaves. Harry killed Voldemort after telling him why he was wrong, and Voldemort had to die having realized that he had went through with all his plans with such certainty of winning, that the certainty turned on him and was the very thing to kill him in the end.\n\nAnyway, your favorite scene?","245":"So in the harry potter world we don't see this very often, but some wands have little extras the wizards have included. \n\nFor example, Lucious malfoy had his wand in the movie seated with a handle that acted as the head of his cane. a lot of artwork (Though no movie or book confirmed wanded) show carvings. \n\nIf wands are alive, which I think is more of a cannon fact than theory at this point, would that be like putting jewelry or putting tattoos on someone unwillingly?","246":"I would choose the owl because I feel like I identify with it a lot.","247":"I have an amazon link but they are out of stock. They are called Brodart 10x21 inches. Anyone knows where I could find them?\n\nThe product name in amazon contains this text \"Ten (10) 10\"H x 21\"L Brodart Fold-On Archival Book Jacket\"","248":"This is a spoiler-free thread dedicated to speculation about actors who could play the Doctor in the future. Pure speculation may be untagged, but any rumours purporting to be factual must be tagged. Outside of this thread, fancasts for future Doctors will be removed. Any confirmed news, including leaks from set, must be tagged. Users click on links at their own risk.\n\nTag your spoilers like so: \n\n     &gt;!This is a spoiler.!&lt;\n\nShows as: &gt;!This is a spoiler.!&lt;\n\nOr\n\n    [Casting Rumour](#s \"Jodie Whittaker will play the Thirteenth Doctor\")\n\nShows as: [Casting Rumour](#s \"Jodie Whittaker will play the Thirteenth Doctor\")\n\n(Please be aware that the second option does not show up properly for mobile users)\n\nNote: Do not give award. Give to charity.","249":"I re-watched the final three episodes of Series 4 after the RTD news was announced and Turn Left really stood out to me - it's genuinely quite scary seeing the world go through crisis after crisis without the Doctor, especially from Donna's perspective. There's London getting obliterated and millions of people dying, the Adipose wiping out the USA, the refugee crisis, concentration camps. It's heavy stuff and pretty unnerving, all without a significant villain or monster (sorry Time Beetle). \n\nIn between all that you've got some great sci-fi, a big returning character, one of Catherine Tate's best performances, some vital character development for Donna and an absolutely massive cliffhanger. \n\nIt's just such a good all-round episode, and I can't wait to see what RTD brings back to the show especially after his last decade or so of writing scripts involving more mature themes. I'm sure there'll be a healthy balance - I'm not expecting the show to become all dark and dreary plus we know how much RTD loves a goofy episode - but it's going to be so refreshing after the show not really delivering strong episodes like this since 2017.","250":"I mean obviously other than “a dump truck full of cash”, what do you think the BBC dangled to attract him back? \n\nCurious as as far as I’m aware he’d previously expressed he had no interest in returning.","251":"Idk why, but doctor who gives me very autumn vibes. I don’t know if I originally started watching it in the autumn, but it seems the perfect time of year to do a rewatch. Currently halfway through series 1 and the nostalgia is… absolutely fantastic.","252":"I’m genuinely confused, I grew up with his stuff but I think moffats era just blows him out of the water.","253":"It was a new season of doctor who, for some reason Matt Smith was the doctor again, they went in an adventure with some random dude and stuff, but what made all stand out was the ending, the doctor switched his form, he transformed into the 4th doctor, and his personality changed to that other doctor's personality, so it was basically a new doctor that could switch his physical  and mental form at will to be one of his past selves.","254":"So now that We know RTD is coming back. What are some RTD era monsters &amp; enemies that you would love to see return to the series? \n\nMyself personally I would love to see: \n(And I know some of these weren’t created by RTD, but I’m just meaning from his era) \n\n- The Slitheen (or more specifically a new family of Raxacoricofallapatorian’s) - I think they deserve a return and with today’s updates CGI I think they could look really good! I loved the book “The Monsters Inside” and thought it was cool to see that not all Raxacoricofallapatorian’s needed larger people to use as suits. So again, their return could be very cool and probably wouldn’t need to full of fart jokes this time. \n\n\n- The Reapers - I’ve felt there’s been a lot of times throughout NewWho where the Reapers should have shown up but didn’t. I’d love to see them return, learn more about them and like I said before with updated CGI they could look really good! \n\n\n- The Gelth - I thought they were a really cool concept and would be fun to see them again. Perhaps this time before they lost their physical form or after they have found a new one. \n\n\n- The Carrionites - I love witches and I LOVED “The Shakespeare Code” would be very cool to see them back! \n\n\n- Autons - Not specifically an RTD monster, but seeing as he brought back Doctor Who with the Autons, it would be pretty nice to see him bring them back again. Plus we haven’t actually had a story about them properly since :) \n\n\n- The Sycorax - someone pointed them out below and I can’t believe I left them off my list! Would be very cool to see them return! \n\n- Vashta Nerada - if there was a cool scary way to bring these back then that could be very interesting :)","255":"Just a cool coincidence! Probably the only time this is likely to occur back-to-back (unless 14 does one season, I guess....)","256":"I hope so! I would love to see camp aesthetic and domestic approach with todays context. And progressive. RTDs era was the most progressive then, and we all know RTD approach. \nWhat do you think? Specially in the camp aesthetic side, is there a chance for Doctor who to go there?\n\nEdit to add that RTD camp\/ domestic style has evolved recently, as we can see on Years and years for example, so I think that something like that will be really interesting to watch on Doctor who.","257":"Mine is David Tennant (The Idiots lantern) Both when he stood up to the husband and then again when he found that rose lost her face and he said that that makes things \"very simple\" \nHe was the most dangerous doctor to cross in my opinion and that may not be the best thing in every situation but out of all the doctors I've watched he made me feel the most safe for that fact.\n\nEdit: if this has been asked already in sorry, I'm rewatching the show and don't really have anyone passionate enough about the show to ask...","258":"In n-space \/normal space in which the main doctor who takes place Mondas was earths twin planet that left orbit in which the human like mondasians and later the mondasian cybermen are from that left orbit.          \n\nThen if if there is an alternate universe to every happening then there would be swap over where the event that had caused Mondas breakaway from the suns orbit had caused earths breakaway instead of mondas then what would have happened to earth and mondas would the humans of earth had converted to cybermen or a more primitive form of cyber augmentation if so what would they be called Terran cyberman? Tellurian cybermen? Or would they have gone extinct ? Discuss in the comments 👇\n\n\n[Thanks for listening to my first ever post on Reddit]","259":"Here are a few observations:\n\n1) In 2005, RTD based the revival on shows of the time (such as Buffy). It would not be a stretch to see him playing with the format of the show to make it fit with the modern TV landscape.\n\n2) Monster-of-the-week is outdated. How many shows that aren’t exclusively for kids still use it?\n\n3) Following Children of Earth, RTD said he prefers writing in a serialised format and, forgive me if I’m wrong, but I think every show he’s done since a has been serialised.\n\nI don’t see it as a stretch that Davies’ main job is to renew the show to give it steam before someone else inherits it with a fresh format to work in. I think there’s a good chance his new era on the show will be serialised.\n\nNow, I know yesterday’s news has kinda sidelined S13 but it’s importance will be massive. It’ll essentially be the trial run for serialised Dr Who, to see how the fans take it, see what works and what doesn’t etc… which will give Davies something to go off of.\n\nWhat’s everyone’s thoughts on this? Is serialisation the future of the show? Do you like the idea? I like it but wonder if it kills the potential for classic stand-alone stories like Blink. Perhaps having one-off specials between series (more than just xmas or New Years but an Easter and Halloween one too, seeing as the series themselves are shorter) might ensure great stand-alone stories get a spotlight.","260":"I am thinking of buying a Dalek figure for my desk, but I’m not sure about the quality of the figures. It does say on Amazon that they’re approved by the BBC and officially licensed to make these figures, and the figures themselves are also hand painted. The figure in question is the “Genesis Dalek” (from the episode “Genesis of the Daleks”), which appears to look quite rough on the eyestalk- due to the paint.","261":"So, 9th Doctor is approximately 900 years old. So every Doctor before lived approximately 100 years. Then why does any other Doctor live for so short time? I still can't understand how he can be so old when he always regenerate?","262":"From what I’ve gathered, this episode is a bit of a fan favourite. And I get it as this does feel more like a normal Doctor Who episode. So, compared to the rest of this era’s subpar episodes, this one and the few others that are good do seem to be better than they are. This is a decent episode, but it would be a bit average in past series. I mean, if we compare it to another historical about a misunderstood historical figure at the time he was alive, “Vincent and The Doctor” is a lot better. And that’s what I mean: because this episode is in such a weak era, it seems a lot better than it is. It is a good episode, but when we compare to some of the past stuff, it comes out as average. Nevertheless, we do have to award it some points for managing to be a solid episode in a era that’s really flaky. \n\nThe thing I like the most about this episode isn’t even anything related to Doctor Who. I just like it because, as someone who’s not American, it’s exhausting to see Americans deciding what’s history and who’s important. I’m 30 years old. When I was in school in the 90s and early 00s, we all learned about Thomas Edison. Did we learn anything about Tesla? Not a thing. We all knew Graham Bell and Thomas Edison. Tesla was just forgotten. I only learnt anything about Tesla almost out of high school and even then just that Edison “beat” him on the “AC\/DC war”. \n\nSo it is refreshing to see that Tesla is getting the recognition he deserves. I wish they’d do something similar with the Wright Brothers eventually. Because the invention of the airplane is a bit controversial. I’m a bit rusty on the timeline, but depending on who you ask, the father of the airplane is Brazilian Santos Dumont who was flying around the Eiffel Tower on his 14 Bis while the Wright Brothers were catapulting themselves off the ground. As someone who has been to Santos Dumont’s house in Brazil, that man was just as ingenious as Tesla, and just as robbed. He was also the inventor of the wrist watch, apparently, as he would wind his pocket watch around his wrist. Or so I’ve been told. It’s a very interesting and crazy house. Like, the staircase isn’t a full piece of steps. For every step you only have the step on the side you’re supposed to step on. So first step, right foot, second step, left foot, and so on. There are some other things but this is what I remember the most as I found it a bit hard. Ryan would have never managed to get to the second landing. \n\nAnyway, this is what I like the most about this episode: the debunking of the Edison myth. I’ve been out of school for over a decade now so I don’t know how they’re teaching the history of electric current nowadays, but I do hope that Tesla has gotten more recognition, especially now there’s a car named after him (even if it is Elon Musk’s). \n\nTherefore, a good historical person to talk about on Doctor Who. The execution was good, the story was engaging, the secondary characters interesting, the aliens were average Doctor Who weird aliens. It was a plain good episode. \n\nThe two negative points that I could thing about were: \n\n(i) why was 13 the only one not wearing period clothing? Something that I’ve been feeling is that the production is too scared to put her in more feminine attire as if that would create some sort of commotion (and maybe it really would because god forbid the anti-female Doctor people actually see her in a skirt). While I do understand the choice of making her more of a tomboy (the Doctor, after all, had been a man for 13 incarnations so it would be safe to assume transition would be a bit weird, hence 13 always forgetting to refer to herself as a woman), it’s been a while. Either they explicitly make her non-binary or gender nonconforming, or start actually having 13 be a woman. Now, I’m not one to define what it is to be a woman and that’s why I said it would be fine for her to be gender nonconforming or to ignore typical gender stereotype. But they never do that. Quite the contrary: they make her say she’s had an upgrade. So it’s fine that she is formally a woman, but not fine for her to actually explore being a woman? This is just something that I feel. Like the show wanted to take that step but it’s still very afraid of it so we’re stuck in this limbo. \n\n(ii) Yaz is still a nonexistent character. She gets screen time and yet, if she wasn’t in the scenes she is, nothing would change. I don’t understand why they do this to her. Ryan and Graham have their own thing and Yaz is just there doing nothing. Most of the time she just serves as a tool so some other character can talk. She did this with Tesla before they were kidnapped and then in the end with 13. \n\n(iii) once again we have an exposition at the end, which wasn’t even necessary. Just the final conversation between Tesla and Edison and then Tesla’s last words to the Doctor and co would have been enough. The exposition was overkill. \n\nGrade: 8\/10. I was going to give it a 7 because I think it’s just an average episode, but I gave it an 8 because of the era it’s in.","263":"\n\n[View Poll](https:\/\/www.reddit.com\/poll\/pvn3oz)","264":"she's a phenomenal actress and i love her, and shes quite popular too especially after Chilling Adventures of Sabrina. Plus she played the character of 'Missy' in peter capaldi's era. idk i feel like that would be make interesting concept, the masters previous body now belonging to the doctor. Because i assume the Time Lords cant actually control which body they get after regeneration so its viable right? plus i feel like that could lead to some funny scenes😂 honestly i just wanna see her in the show again shes amazing.","265":"I saw this video youtube.com\/watch?v=9BdE6ZqCODk and at 2:25 they mention that one shot from Part 2 is missing and that it was also missing from the Special Edition and I want to know if it is there in the original 2004 DVD release. I don’t have either version and I want to know but there isn’t any discussion about it online as far as I can tell","266":"Truly, in my opinion, was there no better combination than Russell's writing and Murray's music. 10s regeneration score and Rose's themes are some of the best musical compositions in TV history (imo).\n\nWhat do you think, would you want Murray Gold to return or to have a new composer on board?","267":"I really hope Torchwood and UNIT, come back into the series in a big way. All that history I think would really help bring many fans back. I’m really excited for him to come back because I feel like he must have a plan for the 60th anniversary. I can’t wait to see what it is and I bet you he already knows who he would like to return as the doctors. If he can do what Moffett did for the 50th I think that would be amazing! \n\nI just would like to see an over arching story that connects to the 60th anniversary for the season he is doing. I just think it would be really great if he planned out a long arc that last 3 series! Those are my thoughts do people agree with me or disagree I would love to care what others think!","268":"By the Doctor, I mean the Fourteenth Doctor...assuming there will be one in place.\n\nAs of now the plan seems to be:\n\n1. Jodie's final story is in 2022, with a special for the BBC centenary.\n\n2. RTD is doing the 60th anniversary special and ''the season beyond''...which presumably means a 2024 premiere for Series 14.\n\nPut this together, it seems like the 2022 special will end with Thirteen regenerating. And the next episode planned, as far as we know, is the 60th anniversary.\n\nSo how does *that* work?\n\nThe options I can think of, off the top of my mind are:\n\n1. Thirteen regenerates, but we don't see who Fourteen is (something that hasn't happened since Two's regeneration at the end of *The War Games*). The 60th anniversary is a standalone special with old Doctors returning (Ten for certain, and maybe 1-2 more). And the Series 14 premiere will introduce us to Fourteen (with maybe a brief cameo in the 60th ala Twelve in the 50th).\n\n2. Thirteen regenerates into Fourteen, whose first full story will be the 60th anniversary, which is *also* a multi-Doctor story. A possible plot-line here could be something akin to the Doctor, suffering from post-regenerative trauma needing the help of past incarnations to deal with some threat. Or the Doctor having lost his\/her memories and needing guidance from past Doctors. It would basically be a celebration of the history and legacy of the show through the prism of its future.\n\n3. *Highly* unlikely, but Thirteen *doesn't* regenerate at the end of the 2022 special. Chibnall's last episode *will* bring his era, and her arc, to a close, but she's still out there. The 60th anniversary will have Thirteen as the 'main' Doctor, in a multi-Doctor story, and will end with her regeneration into Fourteen, whose first proper episode will be the Series 14 premiere. Maybe Chibnall will be write Thirteen's regeneration scene in the 60th anniversary special.\n\nWhat do you think is the best of these options, and which one is the most *likely* one?","269":"1. Hide\n2. The Time of Angels\/Flesh and Stone\n3. The Impossible Astronaut\/Day of the Moon\n4. The Pandorica Opens\/The Big Bang\n5. The Eleventh Hour\n6. The Angels Take Manhattan\n7. The Day of the Doctor\n8. The God Complex\n9. A Town Called Mercy\n10. Vincent and the Doctor\n11. The Crimson Horror\n12. The Power of Three\n13. The Rings of Akhaten\n14. Dinosaurs on a Spaceship\n15. Night Terrors\n16. The Wedding of River Song\n17. The Lodger\n18. The Doctor's Wife\n19. A Good Man Goes to War\n20. The Name of the Doctor\n21. The Time of the Doctor\n22. Amy's Choice\n23. The Vampires of Venice\n24. The Hungry Earth\/Cold Blood\n25. Nightmare in Silver\n26. Cold War\n27. The Curse of the Black Spot\n28. A Christmas Carol\n29. Let's Kill Hitler\n30. The Rebel Flesh\/The Almost People\n31. Closing Time\n32. Asylum of the Daleks\n33. Victory of the Daleks\n34. The Snowmen\n35. The Bells of Saint John\n36. The Girl Who Waited\n37. The Doctor, the Widow and the Wardrobe\n38. The Beast Below\n39. Journey to the Centre of the TARDIS\n\nPlease remember these are just my opinions, it's completely okay for you to disagree with me. I realise that some of these placements are unorthodox, I seem to be notorious for my contrarian views, but I will happily give details of my opinions on specific episodes providing that you approach the discussion with respect rather than belittle me for not conforming to accepted opinions.","270":"I dropped off doctor who after Jodie’s first series. Now I’m hearing about RTD coming back I’m sort of thinking of getting caught up but I know the last few series haven’t gone down well. Is it worth catching up or should I just wait until the 60th special?","271":"I think I have a somewhat unique perspective on Doctor Who and TV\/Actors in general. I'm an American and generally don't watch a lot of either TV or movies, save for the franchises I love. So even when it comes to American actors I really don't know many people other then the truly titanic names (and Star Trek actors). And when it comes to British actors it's really just The Doctors and people so famous their name begins with \"Sir\". Just to give you an idea of how few people I know off the top of my head the only Doctor Who actors I've ever recognized are Simon Pegg, Warwick Davis, and Gandalf (does Gandalf count?). And I know for a fact there are more then those two I've seen in other stuff.\n\nSo whenever I see speculation for who the next Doctor will be I always get really confused. Because to me The Doctor is and should be jus that... The Doctor. Every single actor to have ever played the part has been a complete unknown to me. Sure this is more understandable for the older Doctors where even Paul McGann was before my time, but with a few exceptions most of the actors seem to have been huge and\/or well known when the landed the part of The Doctor. And they have only gotten bigger afterwards.\n\nHowever, with the semi-exception of Matt Smith, I have never seen any of the14 Doctors (original) actors in something non-Doctor Who related. ~~Except David Tennant, who was in Harry Potter for all of like 2 minutes and I didn't even notice until it was pointed out to me. So that doesn't really count.~~ I say Matt Smith is the semi-exception because I haven't actually seen anything he's in other then Doctor Who other then some random clips and promotional art.\n\nBut to me Matt Smith is the perfect example of why I think The Doctor should be a complete unknown, at least to me personally. Matt Smith is just so... well Matt Smith. His face is just so distinct, memorable, and unique that for the longest time I couldn't see the actor but just the 11th Doctor. Even off camera. However since his departure he's become such a huge name that even without actually seeing anything else he does outside of Who I now can't see him as anything other then Matt Smith. That man in the Tardis isn't The Doctor, it's Matt Smith. That guy from the Game of Thrones prequel isn't a knight, it's clearly just Matt Smith in some armor.\n\nAnd sure while all the other actors are and shall forever be The Doctor to me and many others, Matt Smith's distinctiveness and prolific career has so many other people has actually detracted from his Doctor for me on rewatches.\n\nThis rule of not knowing the actors actually holds for all the companions as well. Karen Gillan is again a bit of an exception here, but the only thing I've actually seen her in is the Marvel stuff and she's under so much makeup I didn't even know it was her until I read it online after Infinity War (and now it's obvious of course). But she's managed to avoid Matt Smith's fate in my head where she's just Amy Pond in everything else.\n\nI know I'm describing exactly the type of role every actor tries desperately to avoid, but in my own little bubble of knowledge my ideal reaction to every Doctor Who casting, ESPECIALLY the Doctor themselves, should be \"who the heck is that\". And then they play The Doctor and afterwards they never do anything else within that same little bubble of knowledge.\n\nSo I was curious what other people thought of my opinion, as I seem to be a massive minority. And I also want to understand the alternative position of getting actors you already know very well as to me that's just not who The Doctor is. And just to be clear I'm not saying the BBC should just always hire complete unknowns. It has worked in the past and is a viable gamble, but the complete opposite strategy has also worked to great success. And I want the actors to all have successful lives after the show. I'm just saying on the personal level I think the show works much better when *I specifically* don't know The Doctor as anything else.","272":"I've gone through many of the classic Doctors, and found at least one episode I've loved from each...except for the 5th Doctor. I've never had a 5th Doctor story that made me fall in love with that incarnation specifically. Any recommendations that aren't Caves of Androzani?","273":"From the article announcing RTD being the new showrunner, it says, \"Russell T Davies will make an explosive return to screens to celebrate the 60th Anniversary of Doctor Who in 2023, and series beyond.\" \n\nThis makes it seem that his first episode back is the 60th Anniversary. However, I don't think thats a guarantee. I think they were just promoting and confirming that there would be a 60th Anniversary, with all the speculation and rumors that there wouldn't be. \n\nNovember 23, 2023 is more than 2 years away, and while I am no industry insider, it doesn't take most shows 2 plus years to start getting episodes out (even in times of covid). Davies, with a great deal of experience in TV and being a Doctor Who showrunner, could definitely get a series 14 out prior to the 60th Anniversary. \n\nIf he wants to. \n\nI think it could be that Davies wants the hype of the 60th Anniversary to start his new era with as many eyes as possible. \n\nConversely, he could want his 14th Doctor to have a series under his or her belt prior to having a major anniversary special. (Which would be preferable, imo.) \n\nWhat do you think will be the case?","274":"One of the first thoughts I had after seeing the RTD news was \"god, Jodie could have done amazing with him\". I just am really sorry she didn't get to work with other screenwriters and I got to thinking about the 60th. If it is a multidoctor special, do you think it would be possible for Jodie to be in it along the new Doctor and the old ones? I'm not sure because it'll be maybe too close to her regeneration, but a girl can hope.\n\nAlso, would you like to see her with RTD? Why\/Why not?","275":"russel t davies intended the bronze daleks to be specifically time war daleks, meaning they were mass-produced, didn't care about elegance, rather for war, but since the time war is no longer a major thing anymore, and the daleks don't care about it, does that mean RTD may want a redesign dalek, maybe something more elegant, similar to classic doctor who daleks but modernised, white and blue, silver, grey, not colourfully toy colours, rather something that looks like a uniform, that shows the pride that daleks have, just google dalek redesign fan art, here's a really cool one i found\n\n[https:\/\/www.reddit.com\/r\/doctorwho\/comments\/lnotsv\/the\\_purified\\_a\\_custom\\_dalek\\_redesign\\_3d\/](https:\/\/www.reddit.com\/r\/doctorwho\/comments\/lnotsv\/the_purified_a_custom_dalek_redesign_3d\/)\n\n(not mine)\n\na dalek redesign would make sense","276":"I’ve been a long time DW fan (watching since Eccleston). I, like many others, got excited at the Davies news! When I googled DW to read up on the latest information, I noticed that every Doctor is now listed as the Fugitive Doctor. I had been under the impression that this was just relegated to the Ruth (the actual fugitive doctor) incarnation. Much like how not all the Doctors are the War Doctor. Am I missing something?","277":"&gt;With the exception of the Doctor Who TV movie with Paul McGann, Doctor Who has always been produced purely by the BBC. But from 2023 it will be a co-production with Bad Wolf. The production house was founded by Jane Tranter and Julie Gardner who worked alongside Davies during his time on Doctor Who. Tranter was the BBC's head of drama, Gardner was an executive producer on the show. Both are seen as less high profile, but still crucially important parts of Doctor Who's previous success.  \n&gt;  \n&gt;Davies' return was also welcomed by Bad Wolf, the production company founded in 2015 by former BBC executives Julie Gardner and Jane Tranter. Gardner and Tranter both worked with Davies on the Doctor Who relaunch and will collaborate with him again when he returns as showrunner.  \n&gt;  \n&gt;\"We are delighted to be joining Russell T Davies on a looped ontological paradox,\" said the Bad Wolf Twitter account. \"Where Russell goes, we are proud to follow. With BBC Studios, Bad Wolf will be producing the all-new series of Doctor Who. It is a privilege to be asked to support him in Doctor Who's future.\"\n\nLooking into Tranter &amp; Gardner's production company Bad Wolf and The Night Of, A Discovery of Witches and The Golden Compass are all produced by them. This is massive news. Like with the recent streaming deals with HBO Max and Shanghai Media Group, this helps the BBC (currently under pressure once again to slash its overall spending budget even beyond Who) share production costs and gives the show the ability to hopefully continue and thrive despite this. This is arguably bigger than the Davies news.","278":"I’m already thinking ahead to my plans for RTD’s first episode back with the 60th. Who recons it’ll be shown in cinemas like the 50th was? Failing that, I’m half tempted to hire a cinema room with friends and watch it 🤣","279":"Spent an hour or so last night chatting with someone online about lost Doctor Who episodes and we both agreed that all of them should be remade and even the ones that have been remade already could do with a better version, higher production budget etc. and we eventually got to the point where we were deciding on what would be our true holy grail and we came away with two: \n\n**Dalek Master Plan** \\- Higher budget than we've got but we were undecided as to whether they should do a literal episode for episode reanimation or a condensed version with some stuff cut. \n\n**Evil of the Daleks** \\- Same as above - the online person said that this was his favourite. He'd read the books, watched the reconstructions and listens to the radio play over and over again. He thinks it is a gem of an episode. \n\nSo those are our two. Can you think of any other?","280":"The Master said 'Don't try to regenerate. You got the full blast\" or something like that. Does that mean, that time lord can regenerate if he's just decently injured?","281":"Who do you think it will be? If the answer is different, who do you want it to be? (This is not necessarily about which actor will play 14)\n\n- Option A: Thirteen. People change their minds and Whittaker ends up sticking around a bit longer\n\n- Option B: Fourteen. Whittaker leaves as planned and 14 (whomever it is) makes a full debut in the anniversary special\n\n- Option C: Nobody. They write in a way to have a \"gap\" episode skipping both 13 and 14, and dedicate the entire special to returning Doctors. Maybe cameos for 13\/14","282":"With RTD shockingly returning as showrunner (which many thought would never happen), I'd say the chances of Catherine Tate returning as Donna Noble might have gone up as well. Of course, it's up to Tate if she would return but this would be the cherry on top for me. Donna was the best companion, she was so human and her story ended so tragically. \n\nBut that's another problem, as much as I'd love to see her return I'm apprehensive of them 'ruining' (for want of a better word) her ending.","283":"This episode has to be divided into two parts: before they went down the tunnel and after. \n\nBefore they go down the tunnel, it’s not a terrible episode. It’s not that good, but it isn’t terrible. It builds an interesting concept even: a desolated planet, abandoned, then chosen to be terraformed by a spa ventured in order to, in the future, repopulate and make money with land and property selling. It has some flaws, like why did all of them get in the truck to save Benny, the old guy? They could have just left half of them inside the linen cupboard. Some small flaws, but nothing that would ruin the episode. \n\nAfter they go down the tunnel, it’s downhill fast. First, they find out it’s Earth and the whole speech about how we destroyed the planet start. Then, there’s the whole relationship between Bella and Kane that comes out of nowhere and we really don’t care. We don’t even care about Nevi (I think that’s his name) and Sylas and they’re more likeable. There are too many characters with too many problems all at once. Then the child runs away and, very conveniently, the hopper virus is exactly what they need to make the teleport work, and Kane, who we thought dead, shows up out of nowhere… To finish it off, we have 13 making a speech about global warming. Inside the TARDIS. To the companions. I don’t think I’ve been preached enough. And it’s not like Doctor Who hasn’t done an episode about global warming. They did it in the 70s with the 3rd Doctor (“The Green Death”) and it was way more of an explicit criticism. It was just way better done than the final exposition given by 13. \n\nAlso, Ryan gets to flirt, but Yaz still has no development. I feel really bad for Mandip. She’s billed as a companion, but she’s more of a background character. You take her away from most episodes and it doesn’t change a thing. \n\nGrade: first half, 5; second half, 1. Average: 3. Still better than “The Battle of Ranskoor Av Kolos”.","284":"like, Title.\n\nCan I go into Damaged Goods blind without any other knowledge about the VNA's? I'm considering reading it since it's one of the only pieces of Dr Who RTD is tied to that I haven't seen (outside of SJA Series 3-5).","285":"RTD seems to like to work with people he's worked with before, and worked with both Eccleston and Tennant before Doctor Who - has the recent news changed your mind about who might be the new Doctor?\n\nI've personally been thinking about the cast of It's A Sin, since that's most recent show RTD has worked on. I'd only really be upset with Olly Alexander (he really dragged IAS down, but RTD seemed to like him), but Lydia West could be great, and Keeley Hawes would be an absolute dream casting.","286":"Best of Soundtrack and Score to Doctor Who Spotify Playlist\n\n[Doctor Who Spotify Playlist](https:\/\/open.spotify.com\/playlist\/2UFU2eT2p1welIlTC4fWni?si=O1v4G6rFTnO88pBXvazvDQ&amp;dl_branch=1)\n\nAnything Missing?","287":"So. This is unexpected. Russell T. Davies will return as Showrunner of Doctor Who. In addition to crafting a whole intriguing new era for our venerable program, he will also get to choose the actor who will portray the Fourteenth Doctor. Which got me thinking. Both of his previous Doctors were played by actors who he had worked with before. So I decided to compile a list of actors with whom Davies has previously collaborated, and might therefore possibly be in contention for the role, provided it hasn't been cast already.\n\nNow, I'm not saying that he will pick definitely one of these names. He could go with someone else entirely, with whom he is unacquainted. I'm simply saying that given his past casting history with the Doctor, I would not be entirely surprised if one of these names is selected for the role. (Although I'm still hoping for Jo Martin.)\n\nWho knows? Maybe he could finally fulfill his desire to cast Russell Tovey or Hugh Grant as the Doctor.\n\nLastly, I would like state this probably will not be an exhaustive list. If any names have escaped my attention, please feel free to bring it up in the comments.\n\nSo, without further ado:\n\n* Emma Thompson (my dream pick for years now)\n* T'Nia Miller\n* Lydia West\n* Jessica Hynes\n* Russell Tovey\n* Rory Kinnear\n* Olly Alexander\n* Keeley Hawes\n* Stephen Fry\n* Joanna Page\n* Aidan Gillen\n* Tom Burke\n* Nina Sosanya\n* Gwendoline Christie\n* Bethany Black\n* Ben Whishaw\n* Alex Jennings\n* Simon Pegg\n* Tamsin Grieg\n* Paterson Joseph\n* Marc Warren\n* Tom Ellis\n* Colin McFarlane\n* Felicity Jones\n* Carey Mulligan\n* Colin Salmon\n* Daniel Kaluuya\n* Gemma Chan\n* David Harewood\n* Timothy Dalton\n* Andrew Garfield","288":"so long story short i’m on my period and i’ve been devastated over the 11th doctor’s regeneration for a good two days now even though i watched the episode like 7 years ago and have gotten over it LOL. and i would donate a kidney and my appendix to have matt smith back on the show just to relive that childhood experience i had when i was 6 and seeing him on telly. even though there’s a minuscule chance of this even happening, would it be possible? o.O","289":"I posted this in the comments of a r\/DoctorWhumour post earlier but i quite liked it so figured I’d share it here\n\nokay so, can u imagine, 60th anniversary opens, it’s just Donna and Wilf pottering around the house and there’s a knock at the door, it’s one of the early doctors (while i’d want the classic actor back, it’d realistically have to be a look alike so that they still look young) and they’re just doing some checks or whatever, obviously it’s alien related but they don’t say that, and they introduce themselves as the doctor. boom, donna gets all the memories back and it’s bad, to the point the Doctor has to put her in some kind of suspended animation to stop her from dying from remembering. Then we get a whirl wind of Doctors flurrying past her, trying to think of ways to fix it. Then we settle on ten for a little longer, it’s his fault she’s like this now and you get one of the incredibly emotional scenes we got from Tennant. He still can’t help tho so the flurry continues, enter 14… or maybe 13, with some radical plan that might MIGHT work, but to pull it off, they need help. We’ve got no companions carried over from 13 to 14 so they’re alone, where do they turn, their own past. But not past Doctors, that could be messy, past companions. Not Yaz or the ‘fam’, they left to recently, it’d be sore for the Doctor, but Clara is still around, Martha is with Torchwood, pull Wilf back in, and (if the BBC can get their act together) Jack pulled back together (maybe Lady Me as well, last we saw her was with Clara) to help with whatever this plan is. The episode ends… unsuccessful. Donna couldn’t be saved. Then Clara says she’s ready to return to her timeline. Everyone goes back to their own time and The Doctor is left completely alone. 14 potters around the Tardis, we hear some beeps and then a slow spin around the Tardis control panel (it blocks our view of the Doctor) shows them sat on whatever seating they have, or leaning against the railings or whatever, heavy emotion, and the episode closes. \n\nThe Doctor Will Return Soon.","290":"it is short just like RTD but it's RT2, i have seen RTD2 or even R2D2, but the shortest most convenient one is the RT2 era","291":"\n\n[View Poll](https:\/\/www.reddit.com\/poll\/punsic)","292":"When the 10th doctor met the 5th doctor in time crash, and they both said timey wimey after 10 said wibby wobbly, it made it seem to mean that that phrase was just something that they had in their head for a long time, so when the war doctor was annoyed at the phrase i was like, \"but didnt you say it as 5?\"","293":"Never heard of Russel T Davies as a writer, anything he's written that would give me an idea of how he's going to run the show? All the best x","294":"I've always liked the pre-2005 cybermen designs (Specifically the Moonbase design). My line of thinking is that the Cybermen came from Mondas (a highly advanced alien race) and I thought that the designs from before the reboot gave off this feel better than the ones after doomsday (I presume the cybermen that didn't have the Cyber logo were mondasians because all of the Pete's world cybermen were all sucked into the void) \n\nI think that they looked more advanced due to them not having the metal peices or armor peices or something. I thought that the cloth\/Chrome suits could be seen as sort of like the cybermen are made of Liquid metal, like the T-1000, or as something like their bodies are made out of a single and bendable piece of metal, so to speak. I thought that made them look more elegant and more technologically advanced than the RTD and Moffat Cybermen.\n\nAm I the only one who thought that the cybermen were Liquid metal or as a solid piece of metal?","295":"Just wanna say first of all- I hope I’m wrong about this. The reason I think this is because RTD’s return tells me that BBC are desperate for the show to succeed again and wanna do anything they can to both distinguish it from Chibnall’s era and liken it to RTD’s first era, when the show was at its most successful. So I’m betting they will want the doctor to be male again. As I said, hope I’m wrong, but cynically it’s what I’m not expecting.","296":"The RTD news had me reminiscing as I haven’t watched Doctor Who since around when Matt Smith was the Doctor. I was thinking about watching an old episode when I found out about Heaven Sent and how everyone seems to adore it. \n\nWould I be able to watch it without full context of prior episodes? If not, what will I need to watch to appreciate\/understand it fully? I stopped watching properly probably around halfway through the Matt Smith era, but I’ve seen episodes here and there since.","297":"Now that we know the showrunner, I say in around 3 months we will get the announcement of who the new Doctor will be in the new series.","298":"Years ago I binged all of the NuWho episodes, especially loving Doctors 9 and 10 and 11. I enjoyed the 12th Doctor a lot after that first season of his.\n\nThe thing is, I kind of fell off due to the long breaks between seasons. With the news that RTD is coming back to run the show, my interest is peaking on diving back in.\n\nMy question is basically the following: How would you rate the 13th Doctor's run? Should I really binge however many seasons it's been? What's the overall feeling on her run, basically. What should I expect if I do dive in.","299":"RTD will be doing spin offs I would bet my life on it so that would being said what would you like to see?\n\nI'd like to see a new version of Torchwood headed up by a grown up Luke Smith.","300":"Don't know what the consensus here is, but reddit is where I like to vent my opinions so I figured I'd post here.\n\nTo start with, and I suspect it'll be controversial, but I view Chibnall as a moderate improvement over Moffat.  Moffat delivered some fantastic episodes but he also delivered some which I felt were almost unwatchable. Chibnall's highs aren't as high, but his lows aren't as low. He's consistently ok and I prefer that.\n\nI find the first season respectable. There are a handful of moments I really like. There's a strong \"reboot\" feel. What a lot of people describe as \"preachyness\" always felt like they were leaning into the \"educational\" idea that the show was originally built on, but which has been largely forgotten. The decision to avoid classic enemies seems like a commitment to bring new ideas to the series that sometimes risks continuity lock out for newer fans. Whittaker's performance felt a little disjointed in this season, as did the characterization of the companions. Altogether it's ok, but never amazing. Some respectable and bold decisions that ultimately don't pay off as big as they should. 6.5\/10\n\nSeason two is an improvement. Individual episodes are of roughly the same quality as season one, never outstanding but never unwatchable. However Whittaker has matured into the role and feels more like a cohesive character now. The classic enemies are finally turning up and nice to see. The new Master is good, his destruction of Gallifrey though sloppily handled creates a through line the first season lacked that helps tie this season together. Another controversial take, I like the Timeless child reveal. The finale episode itself is weak, but I think that specific reveal is good. It went way back and used continuity \"slips\" in early classic who, long dismissed by the fandom, to build up a new mystery and new potential regarding the Doctor's past. 7.5\/10\n\nFor me Chibnall and Whittaker are very average. I don't think they're bad, certainly not the worst of Doctor Who (not even the worst of New Who) but I do hope their last season is better, I want something great before they go. And I'm psyched to see RTD back in charge, late Tennant era is what I consider 10\/10 Doctor Who.","301":"These are the two ideas that I feel can be explored in my serial, if you have any others post them in the comments.\n\n[View Poll](https:\/\/www.reddit.com\/poll\/pumrug)","302":"Unpopular opinion I’m sure, I’m half way through season 11 and it is the most enjoyable season for me since season 5. After season 5 it went seriously downhill imo. Season 6 and 7 were a mess and although I thought capaldi was a great doctor, I would describe his three seasons as forgettable and boring. Season 11 however feels so fresh and I’m having an absolute blast watching. Can’t wait to get back to it!","303":"I’m so glad RTD came back, Moffat ruined Doctor Who by making it “so clever” in his head and with stupid and incredibly confusing plots like he did with Sherlock. I know I’m gonna get hate for this but I don’t care.","304":"I see a lot a people saying it *needs* to be another woman because otherwise the first female Doctor will be seen as a 'failure'.\n\nI  disagree. I think the next incarnation should be cast without gender in  mind, I would rather they audition both men and women in order to find  the best choice.\n\n[View Poll](https:\/\/www.reddit.com\/poll\/puk77n)","305":"I just came across the perfect doctor who potholders!! 😍\n\nhttps:\/\/www.etsy.com\/listing\/1071781532\/doctor-who-dalek-potholders-fabric-pot?ref=shop_home_active_8\n\nSo, now I want to make my entire kitchen doctor who themed!\n\nI'm search for doctor who themed kitchen items (plates, cups, curtains, towels) to add to my kitchen.  Anyone else come across any awesome doctor who kitchen items?! Bonus if they are from a small owned business like an etsy shop!  Thank you! 🙏","306":"I'd love to jump back in since I loved Dr Who in highschool! Where should i start if I loved Matt Smiths run I've seen a bit of Eccleston and a few of Tenant already I didn't like Eccleston","307":"ive had a doctor who thought\n\nif they ever had einstein in an episode it would be really funny if they set up the whole \"wow historical figure is shocked by the tardis being bigger on the inside\" but but he just, didnt give a shit*?* like, entirely non-plussed, he looks around for a second and raises his eyebrows for a second and thats it*.* the doctor gets confused and almost offended and asks him why and he's just like \"yes it is dimensionally transcendental, fascinating but I believe we were busy, no?\"","308":"I've recently begun my plunge into the world of Big Finish and I'm just curious as to what people here reckon are some of the great stories to continue with. I've so far listened to Storm Warning, The Sword of Orion, Jubilee, The Sirens of time and Spare Parts. Thinking of definitely continuing with McGanns earlier stuff but still on the fence with where to go especially with the other Doctors. I've so far enjoyed all of these stories quite a bit except for Sword of Orion, that's the only one that didn't really do much for me personally. I've already heard amazing things about alot of McGanns era especially Chimes or Midnight so I plan to pick that one up soon. Any and all recommendations are welcome! :)","309":"I’ll start by saying that this, overall, isn’t a bad episode. It has some flaws, but, it works kinda well. What ruins it is the Master and the start of the Timeless Child BS. \n\nThings that are good:\n\n1. Surprisingly, the fam by themselves, having to go off the grid, spy style. I say they’re good, but it’s mostly Graham and the old shoe shuffle. But them landing the plane and then having to fight Barton all by themselves was interesting. They could have used this opportunities to develop Yaz and again they didn’t. But, nevertheless, it was fun to watch. \n\n2. Important women throughout history and that aren’t exactly well known. Well, Ada Lovelace probably is better known. But I liked how 13’s journey back to the past involved the help of two historical figures that were involved with the development of computers. And Chibnall managed to do this without going all “women rule, men suck”. Instead of trying to diminish men, he highlighted women and that was really well done. Also, 1834 and 1943 were very interesting: the science fair and occupied Paris. \n\n(I did laugh when 13 went “appearing man” and then corrected herself to “lady”, saying “every time…”). \n\n3. I liked the whole concept of the Kassavin, being spies and everything. They’re creepy in their formless light bodies. But I never really understood their plan with Barton. They were just going to use humans as storage devices? That’s it? What about invasion and domination? Or making the Kassavin more stable in our universe? What was the point of the plan? Once again Chibnall has a good idea that he executes poorly. \n\nThings that I didn’t like:\n\n1. The Master. He ruins the entire episode. He’s just all over the place with that out of date crazy perfomance. And, what, he’s paired with the Kassavin and their pointless plan to get the Doctor’s attention? And then he wants to kill her? What was the point of what he was doing? What is his purpose? Also, 13 says they’re old friends, but they never give that impression, which is going back from the development we got from 12 and Missy. 13 and Dhawan’s Master aren’t friends. Don’t try to tell us they are. This episode would have been a lot better without the Master (and his introduction of the destruction of Gallifrey and TCC). The story would have worked better without him (and maybe then the Kassavin could have had a better plan because Chibnall would have more time to develop them instead of having to focus on the Master). Even the whole TCC BS could have been introduced without him. I don’t know why he brought him back so soon after Missy (and in a way that negates a lot of Missy’s work, wether he’s before or after her because we see him after her). On this season we’ll have the Master, the Cybermen AND the Daleks. And we all know how weak it ends, so that goes to show having the Big 3 Villains won’t necessarily make it good. \n\n2. Chibnall has no understanding of how perception works. I know that (i) when 13 kneels in front of the Master, he’s not subjugating her for being a woman and that (ii) 13 probably thought handing the Master to the Nazis would just hinder him enough. But the perception of those scenes is horrible. First, you never, ever, EVER, have your main character hand someone, whoever it is, to the Nazis. That’s a big no. That comes across very wrongly, as if the Nazis are okay as long as they’re a tool. Nazis are never okay and main characters (especially ones that are supposed to be really nice and good) don’t ever work with them or use them. Secondly, you don’t make a woman kneel in front of a man during a scene that transpires dominance and superiority. The Master kneels after a while and we all understand the scene, but it looks bad. Chibnall has made a point to show that he’s worried about addressing issues and being more “woke” (used in whatever meaning, positive or not). So he has to be careful with perception. He failed at that. \n\n3. The destruction of Gallifrey. Why? I don’t understand what was the point of destroying Gallifrey. The TCC storyline doesn’t require the planet to be destroyed. Especially after we went through 3 series to get the damn planet back. It was the whole point of 11’s broader arc: to get Gallifrey back. And the point of “Hell Bent”, besides the Doctor dealing with his grief for Clara and everything, was to show Gallifrey wasn’t important to him anymore. He’s glad that the planet is okay, but he doesn’t care about it. Especially after they tortured him for over 4 billion years. Besides, Gallifrey has never been important on New Who. It was never the main focus of anything. And now we have an entire series focused on the lie of the Time Lords and the planet is destroyed. At least leave the planet there so we can discover more about this TCC BS from the stupid, pompous, foolish Time Lords (unless they’re alive, but that’s such a cheap twist). \n\nThis is what I mean when I say I like Chibnall the writer but I hate Chibnall the fan. He had a good episode in his hands and he ruined it because he had to succumb to his crazy theories about the 10s of random faces on “The Brain of Morbius”. But we’ll deal with that on the episode that must not be named. \n\nGrade: 6\/10. I was going to give it 4 or 5 because the Master and the beginning of the TCC ruin it, but I’m being generous because for once the fam was interesting by themselves and the historical women were a very nice touch. So I’m awarding extra points for that.","310":"\n\n[View Poll](https:\/\/www.reddit.com\/poll\/pulhew)","311":"\n\n[View Poll](https:\/\/www.reddit.com\/poll\/pu7dum)","312":"What movies, TV or streamed media has captured your attention?\n\nGive us a short review!","313":"Discussion thread for the various questions about the virus, borders, impacts, Centrelink issues and general observations of human behaviour.\n\nDedicated subreddits:\n\n* [CoronaVirus Australia](\/r\/CoronavirusAustralia)\n* [CoronaVirus Downunder](\/r\/CoronavirusDownunder)\n* [Centrelink](\/r\/centrelinkoz)\n\n[The daily numbers](https:\/\/covidlive.com.au\/)\n\n[Daily briefing, State-by-state and case information](https:\/\/www.covid19data.com.au\/)\n\nExposure sites:\n\n* [Vic](https:\/\/www.coronavirus.vic.gov.au\/exposure-sites)\n* [NSW](https:\/\/www.nsw.gov.au\/covid-19\/nsw-covid-19-case-locations)\n* [Qld](https:\/\/www.qld.gov.au\/health\/conditions\/health-alerts\/coronavirus-covid-19\/current-status\/contact-tracing)\n* [ACT](https:\/\/www.covid19.act.gov.au\/act-status-and-response\/act-covid-19-exposure-locations)\n\nFriends don't let friends get medical advice from Facebook, get vaxxed now:\n\n* [Vic](https:\/\/portal.cvms.vic.gov.au\/book\/)\n* [NSW](https:\/\/covid-vaccine.healthdirect.gov.au\/eligibility?lang=en)\n\n\n[Previous Megathread](https:\/\/redd.it\/pfu97c)","314":"What a fight! It’s pretty special to have an Aussie with a belt and I think it deserves more recognition","315":"I’m not even going to go into detail about my latest struggle with them but I just need to say FUCK Telstra and FUCK how they treat their loyal customers. Not once in 15 years have I had a good experience with them. Maybe if they had some decent competition I would leave but I can’t get decent coverage with anyone else.","316":"So the cliffhanger of Silversun has annoyed me since it happened 15ish years ago. Why did it end like that?!\n\nSo hoping there’s a TV exec on here willing to pick it up where it left off. Use exactly the same actors but they all aged as they went through the wormhole.","317":"I finally figured out why foreigners are so apprehensive of wild Australia. It basically comes down to Teeth Vs. Traps.\n\nIt's the classic \"Law of the Jungle\" - a set of clear \"rules\" our primitive monkey brains get.\n\nThere are big bloodthirsty things with teeth that will stalk, hunt and chase you down - tigers, bears, wolves, hyenas, jaguars, etc.\n\nIt goes like this: something hungry picks up your trail and comes for you. Then it's fight or flight. Classic David Attenborough or National Geographic stuff.\n\nBut in Australia, there is no Law of the Jungle. No black and white simplicity. No big predators coming for you (crocs and sharks hunt are aquatic, so don't really count). \n\nSo, instead of \"Jaws on Land\", wild Australia is a biological \"Indiana Jones temple\".\n\nHere, you can do everything right according to the \"Law of the Jungle\" and you'll be fine, until...\n\nYou brush past the wrong tree, sit without looking, walk through long grass, pick up a seashell or simply stand under a tree in spring time, and then it's a world of hurt.\n\nYet none of these hazards is trying to eat you, just to injure you senselessly and instantly.\n\nIt is all \"unfair\" according to the aeons-old \"Law of the Jungle\" survival instincts of homo sapiens.  \n\nSo, instead, this land is an elaborate interlocking set of living booby traps. Set up by no one and apparently achieving nothing. It's just random poisoning, stinging, jabbing and pain.\n\n... and *then* there are the crocs and sharks.","318":"Came across this delightful little friend on a walk yesterday. Am lucky enough to live in a location with lots of native wildlife, and see them regularly around this time of year. The most I've enjoyed any grand final day!\n\nhttps:\/\/preview.redd.it\/wu0cyqxkjrp71.jpg?width=1440&amp;format=pjpg&amp;auto=webp&amp;s=caeb400ffaedd2710a4346494f2562d49d3f0429","319":"I worked for a department in 2002 (rhymes with ‘Benterkink’) and didn’t make it past the 6 month probation period (maybe it was 3 months..?). Basically due to being young\/going through a rough period, multiple instances of lateness &amp; absenteeism. (I also hated the role and the way the department is run, my fault they got in first). I am now applying for another public sector position &amp; the application has asked if I worked for them previously (new role is not related to Benterkink in any way).\n\nI don’t want to lie because it’s obviously not the best way to start a new job. But I don’t want to ruin my chances of a new role because of being a young idiot nearly 20 years ago. I have been in stable employment for the past 12 years (travelling &amp; living OS prior to that).\n\nDoes anyone have any knowledge of how long the public sector keeps employee  records for? TIA for any information.","320":"I’m super mega stuck on this one question in my PSPLEG002 Unit AT2 of crime and justice. The question is asking me how the ambulance service act 1991 (QLD), the public sector ethics act 1994 (QLD) and the public service act 2008 (QLD) work together to provide oversight of the public service. \nI cannot figure it out and have been stuck on it all weekend. This assessment is due midday today so I cannot email my teacher about it and only had the weekend to work on it.","321":"Hi everyone! I would appreciate any insight into this issue. \n\nFor context, I take an antidepressant for the management of a mental health disorder. I attempted suicide in January of this year, and since then my GP has prescribed my antidepressant to be dispensed weekly by the pharmacy so that I cannot overdose. \n\nFor the past 6 months I have been receiving my script weekly from a chemist warehouse and only had to pay for the cost of the prescription. I have had to move chemists to use my new script so it's closer to home.\n\nI went to a chemist warehouse closer to home and was told that I would need to pay a weekly dispense fee of $5. I said no and that I would go elsewhere. I am now at a priceline pharmacy near my house and have been told that I need to pay a $5 weekly dispense fee. I asked them what the reason for this was as it wasn't my request to have the medication dispensed weekly, it has been imposed on me by my GP for my safety. They just said that the pharmacy manager has put in a rule to charge people for a weekly dispense. \n\nMy question is, is this charge lawful? I am unable to receive my prescription in full due to being a suicide risk. Is this discrimination? I would appreciate any insight.","322":"I am an American so my perception could be very wrong. But, I love reading about crime and Adelaide seems to come up way too often when reading about some horrific Australian crime. Is that a thing, or am I dumb? Thanks down under.","323":"Looking for some new clothes for Spring\/Summer. Anyone have any recommendations on nice, non fast-fashion shops\/sites? Doesn’t have to be dirt cheap but nothing too expensive.\n\nThanks!","324":"Hi fellow Aussies.  Looking for suggestions to beef up my best of Oz playlist.  Any genre. Any gems from the 50s to now.  Obscure to popular.  As long as it's a great song!  What are your faves?  What have I missed?","325":"Title pretty much. Poor uni student looking to get a bit smashed in the holidays. Cheers","326":"I signed the contract for a RAV4 GX model in April 2021 and haven’t heard anything from Toyota yet. I understand there is a global shortage of semiconductor chips which severely affects production. The reps at Toyota can’t promise me anything. Just wondering if any fellow Aussies are on the same board?","327":"\n\nMy NSW roadworthy is up next month and I won't be back in NSW to get a pink slip before it runs out.\n\nThey accept safety checks from other states as long as you are at least 50km away from the boarder and it covers similar checks to the pink slip inspection. I'm currently in Cairns but am about to head off to the NT.\n\nI'm wondering if anyone has any knowledge of the QLD and NT safety inspections? I know the pink slip isn't too in depth so I'm wondering which state, out of NT or QLD is closest to the pink slip?\n\nThanks!","328":"So long as the jar is sealed, and kept in a dark cupboard, how long should Vegemite last?\n\nI have a small jar with the best before date of 2015, (which means it was probably bought in 2013). I had some on my toast this morning, and while the taste was a little different, it was fully edible. I imagine  the ingredients may have changed in the last 8 years or so, which would  account for the slight taste difference.","329":"Just rewatched the 2000 movie and he referred to someone as a bare arse in the shower, also i remember it being alluded to in Underbelly season 1 they say soom \"pppr guy\" shared a cell with him when they were only 16 and in season 2 he is shown attacking inmates in the shower although not raping them.\n\nJust wondering if that was the case or not.","330":"James Duckworth loses to Kwon Soon-Woo 7–6(8–6), 6–3 in his first ATP Final in his career in the 2021 Astana Open. \n\nThis means Aussie men are 3\/4 for ATP finals this year with Alex De Minaur winning the Antalya Open and Eastbourne International as well as Alexei Popyrin winning the Singapore Open.\n\nNeed more people updating others on the Aussie tennis players as there is an ATP tournament\/Grand Slam every week of the calendar year","331":"Any redditors from down under know of any liquor stores that ship to the U.S? I’m looking for get a few bottles of a liquor for a wedding later this year and I can’t find it here. Any help would be really appreciated! Thank you.","332":"Based in Brisbane and don't have the patience to wait 2 weeks.  Thanks in advance!","333":"I need a white card for a job I've been offered, my boss says you can get it online but a ton of sites I've seen are dodgy af. Checking site credentials and most if not all have almost no visits, are created recently (within this month or less) and all around just look off. Anyone know any official sites?","334":"I bought this place a year ago, and when I moved in there was a note on the bench from the previous owner with their forwarding address. Fair enough. Moving sucks, and it takes time to update your address everywhere.\n\nFor the first few months I would forward their mail, then I started \"RTSing\" it instead, hoping that the senders would contact them for an updated address.\n\nForwarding or RTSing, I have to make a special trip to the post box to deal with the mail.\n\nIt has been 12 months now, and I'm *really* sick of dealing with their post. Surely they should have updated their address with everyone by now. But no, I even got their new credit and medicare cards recently!\n\nAt what point do I just start binning it....?","335":"Hey everyone, this is a weird request. I'm willing to pay someone if they can help me buy an item from a local store in Griffith and send it to me via mail, which I'll also pay for. I'd appreciate if anyone can help","336":"I'm looking at purchasing \"PlayStation Store $50 Gift Card (Digital Download)\" by using a egift card I am able to purchase with credit earned on MyView.\n\nI emailed the support, which appears to be the only way other than calling that you can reach a human (wtf jbhifi...)\n\nThey then uselessly came back and told me \"JB Hi-Fi gift cards cannot be redeemed for other JB Hi-Fi gift cards.\" On the JB Hifi website, they have a completely different section for their own gift cards, so I am assuming this is what they mean.\n\nBut from reviews I've read, other people HAVE used gift cards to purchase the Playstation Store Gift Cards and furthermore, upon checkout I have the option to enter a gift card number.\n\nNow I don't want to redeem my MyView points only to find out that it's not going to work, but customer support is so god awful, it takes approx 4 days to get a reply which didn't even truly answer my question.\n\nDoes anyone have experience using Gift cards to purchase the Playstation Store Credit from JB HiFi and\/or can answer my question.\n\nTIA  \n\n\nEdit: I have never understood reddit. Why downvote me for asking a question that seems to have multiple different potential answers and I'm just trying to find out what the reality is. Why not just move on with your scrolling. God reddit irks me.","337":"# What the heck happened to \/r\/Obama last week!? A Q&amp;A.\n\nLast Wednesday there was a huge invasion of members of the quarantined sub \/r\/ ChapoTrapHouse (CTH) posting all kinds of anti-Obama and troll posts and comments.\n\n**Why then?**\n\nThe top mod of \/r\/Obama, who is an active member of CTH, did a post to CTH inviting CTH members to brigade \/r\/Obama.\n\n**Couldn't you do anything?**\n\nNot really. He was the top moderator.\n\n**Why didn't the reddit admins act? Isn't brigading against reddit rules?**\n\nDespite several users reporting the problem it took quite awhile to get their attention, and even longer for them to take action. The admins started taking action late Friday afternoon. \n\n**So what did the admins do?**\n\nThe admins removed the top mod for violating moderation guidelines. Plus they removed  all the other mods from CTH he had added. They also deleted the post at CTH.\n\n&gt; Sorry, this post was removed by Reddit's Legal Operations team.\nThis content was removed for a violation of Reddit's Content Policy .\n\n**Why was he the top mod?**\n\nSome reddit history:\n\nIn the very beginning reddit had no subreddits. When they finally started adding subs, \/r\/Obama was one of the first subs. Back then folks became moderators either by being added by an existing mod or because they were a very active participant in the sub. That's how I became a mod of \/Obama. I didn't even get a PM telling me I was a mod. I just noticed I was a mod on my user page one day.\n\nWhen I became a mod there were 7-10 users above me that were active users and moderators so I really didn't need to do any moderation in the sub. Eventually there were about 5-8 more below me. But sometime after Obama's second inauguration I noticed some of those mods were drifting away and demodding themselves. Some of them even left reddit completely.\n\nEventually about 4-5 years ago I noticed that there was only one user who was really looking after the sub so I started more actively modding \/Obama. That mod eventually drifted away too, so I've been the only active mod for r\/Obama for awhile.\n\nAnd the (former) top mod? He was the last mod remaining above me, but I'd had never seen him do any real moderation tasks in at least five years.\n\n**So what happened after the admins acted?**\n\nI was left as the top mod. \n\nI then tried to restore \/Obama to pre-brigade status. I deleted all the CTH posts, locked them, and then deleted everyone's comments to those posts.\n\n**So the sub is back to the way it was?**\n\nMore or less. \n\nBut there were about 400 new subscribers to the sub in 3 days (and around 150 unsubscribes), likely almost all CTH members (daily subscriptions to \/Obama usually range from 5-50 per day). The sub is also seeing elevated pageviews, but not as many as the first couple of days.  \n\nThere haven't been any more CTH posts, but there as been significantly more downvoting in the sub the last few days. Posts used to usually get 90-97% upvotes, but now posts range from 55-80% upvotes.\n\n**Can I do anything to help?**\n\nUpvote the posts you think should be upvoted.\n\nPlus I can't check everything, so please report any posts that violate this sub's or reddit rules. BUT REMEMBER THE REPORT LINK IS NOT A SUPER-DOWNVOTE. Do not report something just because you disagree with it.\n\n**Now back to your regularly scheduled program.**\n\n----\n\n**Update:** 29 June 2020\n\nCTH just got banned (as well as \/t_d). \n\nhttps:\/\/old.reddit.com\/r\/announcements\/comments\/hi3oht\/update_to_our_content_policy\/\n\n----\n\n175\n\n----","338":"r\/ThanksObama\n\nTraffic is down over a third from last year. And way down from the sub's high point. There's very rarely at least a dozen users in this sub at one time. \n\nSurprisingly there are still new subscribers, but net subscriptions is very rarely over 5\/day.\n\nThe only folks who post to this sub besides me are trolls (who apparently think \"What is Obama's last name?\" is funny and original and are usually associated with a small set of non-sequitur meme subs — I assume it gets discussed in a discord channel).\n\nPosts rarely get 4 comments, with half often troll comments. \n\nPosts rarely get more than 50 upvotes where even 6-12 months ago over 150 upvotes was fairly common. Which is actually pretty amazing — it means 50-80% of unique visitors have voted on that post.\n\n----\n\nSo comment down below. I'm looking for a consensus opinion. Should r\/Obama be turned private or just closed to new submissions?\n\n----\n\nIf you want to help keep the sub going, look for interesting articles to post. You can start here: https:\/\/news.google.com\/search?for=Obama\n\nOr, for awhile I was posting an official Obama photo a day from Flickr archives. Those usually got a good response.\n\nhttps:\/\/www.flickr.com\/photos\/obamawhitehouse\/\n\nhttps:\/\/www.flickr.com\/photos\/barackobamadotcom\/\n\nhttps:\/\/www.flickr.com\/photos\/tags\/Obama\/\n\nhttp:\/\/www.flickr.com\/photos\/marcn\/tags\/barackobama\/\n\nIt might be nice to see some of his old speeches posted, but\n\nFrom the posting rules in this sub’s sidebar: \n\n&gt; Only videos of Barack Obama's speeches and interviews from original sources (such as C-SPAN or WH.gov). No rehosted videos. No other videos. No animated GIFs.\n\n----","339":"(Note:  This was written days ago and autoposted one minute after the scheduled inauguration of Joseph Biden as the 46th President of the United States of America.)\n\nIt's been a... time.  Thank you for all the posts and comments and support.  You kept us all just a bit more sane these last four years.\n\nAs to what comes next, we have no idea.  We're closing up shop, at least for now.  We may reopen anywhere between one week and never.  Nothing is set, yet.  But please do appreciate the following:\n\n1)  We have no interest in continuing to cover Donald J. Trump, \"citizen\" and former President of the United States unless he is still active and meaningful in the day-to-day lives of Americans.  And has a easily linkable presence on some web platform somewhere.\n\n2)  We have no interest in being any sort of archive of Trump's crimes and misdeeds, or an ongoing living breathing \"Best Of\" compilation subreddit.  We don't have anywhere near all of Trump's tweets.  There are existing archives out there that have captured his tweets.  ( r\/TrumpTweets\/ or [http:\/\/theTrumpArchive.com](http:\/\/theTrumpArchive.com) or the [Wayback Machine](https:\/\/web.archive.org\/web\/20210106234054\/https:\/\/twitter.com\/realdonaldtrump\/status\/784767399442653184) )\n\n3)  We have no interest in covering any of the other Trump Crime Family.  Not unless they become politically relevant in a significant way to the nation's discourse.  (Yes, they're scummy.  Yes, they'll probably blather on endlessly via various platforms.  But, at this point in time, they do not appear to be relevant.)\n\n4)  We have no interest in pivoting our coverage to include *\\[insert politician, political party here\\]*.  This sub was meant to cover President Trump.  Nothing else.  It makes no sense to expand our coverage to other politicians.\n\n5)  We have no interest in adding moderators or handing this sub over to folks interested in doing any of the above, or using it to sell novelty flipflops.  \n\nI spell all of this out not to be dismissive, but to make it clear what the intentions are.   There are other threads here where these issues have been discussed.  Thank you for your ideas and your enthusiasm.  But, I don't wish to rehash these discussions.   I'm tired.  I'm done.  This sub will be here, and if you need a trip down memory lane, browse our nearly 4 year record.  I would not advise it.  It's time to move forward.\n\nSo, with a heartfelt thank you, I will say \"so long\" and perhaps we shall cross paths at some future time.  This community has reached its natural end of life.\n\n [it-takes-forever-to-say-goodbye-false-it-takes-exactly-978-seconds-to-say-goodbye.jpg (3000×2000) (memegenerator.net)](https:\/\/memegenerator.net\/img\/instances\/68471117\/it-takes-forever-to-say-goodbye-false-it-takes-exactly-978-seconds-to-say-goodbye.jpg) \n\nAnd I apologize.  That took way longer than 0.978 seconds.","340":"As part of [r\/TrumpCriticizesTrump](https:\/\/new.reddit.com\/r\/TrumpCriticizesTrump\/) 's long \"good bye\" on Inauguration Day, please use this thread to share your thoughts on the new 46th President of the United States, as well as reflect upon the 4 years of the Trump Administration, the 2015-2016 Trump campaign, and even the Obama Administration.\n\nThis is a celebration party.  Keep it light.  Have fun!  Trump is finally gone.\n\n&amp;#x200B;\n\n*The rules for this post are loosey goosey. Remain civil. Keep it respectful to the new President, and your fellow redditors. Trump supporters may comment here, but keep it neutral, don't spread misinformation, don't gloat, or otherwise display trollish behavior. This is not your party!  Spammers will be banned.  Trolls will be banned.*","341":"# We'll be back...\n\nOn Wednesday Jan 13 at 1700 UTC \/ 12:01pm EST \/ 9am PST, r\/TrumpCriticizesTrump\/ will return, but in a slightly different format.\n\n##EDIT##\n\n**We're live.**\n\n**Please review the rules here:  https:\/\/old.reddit.com\/r\/TrumpCriticizesTrump\/wiki\/tct_rules**\n\n---\n\nIt is unclear what comes of this sub after Jan 20th.  So, enjoy it while you can.","342":"As we continue to attempt to deny a venue for Trump's campaign to undermine the results of the election, we have temporarily updated the sub's rules:\n\n1)  In general, if the tweet is flagged as false or otherwise problematic by Twitter, it's not eligible to be posted here.  (You can however, create a link post using an older tweet, and use the new flagged tweet as your follow-up context comment.)\n\n2)  In case some tweets are not flagged by Twitter, we will be removing posts that deal with the 2020 presidential election, the count, the results, etc.  (You can use a 2020 tweet as the follow-up context comment for an older tweet used as your link post.)\n\nWe will continue to monitor the situation and may make further changes in the days to come.\n\nBe well.  Stay safe.","343":"_REVISED Nov 6 ~13:00 EST\n\n**Just a quick revision to this policy.  We are going to selectively allow election related Trump quotes going forward.  However, they _must not_ be quotes that when looked at out of context of this sub (e.g. the front page of reddit, or to a casual scroller) appear to support Trump's arguments against the validity of this election.  (Even if the statement is old.  Even if it mentions political figures not currently running.)**\n\nIf in doubt, please contact the mods beforehand.  And, given the dynamic nature of the situation, please accept that changes to this policy, big and small, may occur over the coming hours or days.\n\n\/e\n\n---\n\nWhile our President is doing everything possible to undermine the integrity of this election, we are not allowing any quotes (tweets, mostly) from Trump that are talking about \"voting\", \"election\", or any issues that could appear to amplify his messaging related to the election.  This applies to ALL Trump quotes related to these issues, whether contemporary or archival, whether \"good\" or \"bad\" (however those may be qualified).\n\nI understand that we would be highlighting these messages to point out his hypocrisy or otherwise lambast him.  But to do that we have to expose his messages to a wider audience.  And that feels irresponsible under current conditions."}}